[{"job_id":"4228329117","title":"Back End Developer","company":"The Planet Group","location":"United States","posted_date_attr":"2025-05-15","posted_text":"5 days ago","link":"https://www.linkedin.com/jobs/view/back-end-developer-at-the-planet-group-4228329117?position=1&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=2UMxa3TZ2mrfQu3E1FSpeg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4228329117?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"W2 Only, No C2CFully remote, 5-month opportunity with high chance of extension5+ years of experience in backend development, ideally in a fast-moving environment.Strong expertise in Golang and Python.Familiarity with GraphQL APIs, GraphQL Router and Federation are a plus.Excellent debugging and problem-solving skills.Quick learner with the ability to pick up unfamiliar tools or systems quickly.Strong collaboration and communication skills, able to work effectively in distributed teams.","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Contract","Job function":"Engineering","Industries":"Social Networking Platforms"},"seniority":"Mid-Senior level","employment_type":"Contract","job_function":"Engineering","industries":"Social Networking Platforms"},{"job_id":"4224150555","title":"Blockchain Engineer - Smart Contracts","company":"Offchain Labs","location":"United States","posted_date_attr":"2025-04-11","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/blockchain-engineer-smart-contracts-at-offchain-labs-4224150555?position=2&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=oTD2FHgWK6rIJCSEmp1RXg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4224150555?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"At Offchain Labs, we are not just building products — we’re leading a movement.We are committed to creating a decentralized, secure, and transparent future through blockchain technology. Our mission is to push the boundaries of blockchain innovation and foster a creative, collaborative, and inclusive culture where ideas can come to life. We know that the future of blockchain technology is limitless, and the best way to achieve this is by working with the brightest minds.We’re looking for thinkers and doers who are eager to embrace new challenges and seek solutions that will push existing boundaries. If you believe in the importance of transparency, trust, and the decentralization of control, and if you’re curious, adaptable, and want to disrupt the status quo, then we want to hear from you.Why Offchain Labs?Our team is committed to bridging the gap between the current state of blockchain and its potential. Our flagship product, Arbitrum One, is a dominant force in Ethereum scaling and is trusted by enterprises, developers, and users worldwide. But that’s just the beginning. Our passionate team is constantly building on this success, rolling out innovative tools such as Arbitrum AnyTrust, Arbitrum Orbit, Stylus, BoLD, and Arbitrum Nitro. Offchain Labs also contributes to the Ethereum core protocol with the Prysm consensus client.Following the successful raising of $3.8M in seed funding in January 2019, as well as $20M in Series A and $100M in Series B funding in 2021, we are looking to expand our team. We invite individuals with a strong interest in blockchain and a talent for approaching problems from unique perspectives to join us in shaping the future of this dynamic field.At Offchain Labs, we're pushing the boundaries of what's possible in the blockchain domain. As part of the Blockchain Engineering team at Offchain Labs, you'll get to work on the cutting edge of blockchain development solving novel technical, economic, and social challenges. In this role you’ll work on the full lifecycle of smart contracts involved in the Arbitrum Nitro stack, including helping develop specifications, prototyping, developing production code, engaging in rigorous testing, and working directly with external auditors. You’ll collaborate closely with our research team, product team, and company leaders, including our CTO.Who you are:Deep understanding of blockchain development at the protocol level of the Ethereum NetworkExperience with solidity and other Web3 related technologiesPossess a strong sense of ownership in your work, which drives you to find ways to do things better and fasterAlways up-to-speed on the latest technologiesConstantly on the lookout for new and innovative ways to solve complex problems through rigorous experimentationPossess a great attention to detailYour communication style is open, transparent, and direct, and you consistently work in tight collaboration with your teammatesSecurity-minded and always keeping an eye out for potential threats and vulnerabilities in your codeAlways open to feedback, new ideas, and opportunities for self-improvementYou look for ways to help out beyond the scope of your day-to-day workWhat you'll need:2 years of experience working with blockchain technologyEager to bring cutting-edge research to the real world and help build a platform for the next generation of cryptocurrency applicationsMastered CS fundamentals, either in a formal university program or through self-learningPerks:Remote-first global workforce + NY officeAnnual company offsite + team onsitesProfessional reimbursement program (facilitates industry conference attendance, certifications, and more)Medical, dental & vision coverage (US + some other countries)401k retirement plan + company match (US only)Wellness stipendHome office set up / ergonomic equipment programAttention Offchain Labs Job Seekers:Please be advised that there has been a rise in fraudulent recruiter activities, particularly within the Web3 space. If you would like to confirm whether someone is an OCL employee or the legitimacy of an offer you received, please email jobs@offchainlabs.comWe understand it takes a diverse team of highly intelligent, passionate, curious, and creative people to solve the challenges involved in developing and improving Arbitrum. Our dynamic team has incredible perspectives to share, just as we know you do, and we take great pride in being an equal opportunity workplace.","applicants_count":"30","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Not Applicable","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Hospitality, Food and Beverage Services, and Retail"},"seniority":"Not Applicable","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Hospitality, Food and Beverage Services, and Retail"},{"job_id":"4224156065","title":"Senior Software Engineer","company":"OptionMetrics","location":"New York, NY","posted_date_attr":"2025-04-24","posted_text":"3 weeks ago","link":"https://www.linkedin.com/jobs/view/senior-software-engineer-at-optionmetrics-4224156065?position=3&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=OmJR4Osqa7JSKnmnmEVO1A%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4224156065?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"About Us:OptionMetrics, headquartered in New York, NY. is a dynamic and innovative technology company, a trusted provider of financial information and research derived from the option markets. We are at the forefront of developing solutions that empower businesses. Our commitment to excellence, coupled with a collaborative, forward-thinking culture, has made us the preferred choice for top-tier talent. Our data and analytics models are utilized by over 350 investment banks, hedge funds, asset management firms, and academic institutions globally, solidifying our position as a leader in the industry.As a Senior Software Engineer, you will have a variety of technologies to work with. Python, Java, C#, and Go we use them all! Our infrastructure is 100% cloud-based, which means you can finally say goodbye to soul-crushing technical debt and hello to cutting-edge tools and tech! You will develop applications accessing large financial data sets. You will collaborate daily with Operations and Product teams to brainstorm and implement our next generation of data and analytic information products.Here at OptionMetrics, we emphasize accountability over micromanagement. We invest in our talent with free learning resources like Udemy courses, Educative, and other subscriptions, and even pay for conferences and certification exams! We're small, agile and passionate about our mission and the projects we create. As a development team member, you will have true ownership over your projects from beginning to end.This position is able to be remote in the United States or hybrid, working out of our NYC or Miami, Florida office.Our Technology Stack: Languages: Java, Python, C# Databases: Postgres, MS SQL Server, Snowflake Frameworks & Libraries: Serverless, React, Pandas, Polars, Spring Boot AWS: Lambda, EC2, EBS, Cloud Formation, Step FunctionsWhat You'll Do: Develop applications that access, manipulate, and deliver large financial data sets Implement scalable cloud-based solutions for data storage and processing, as well as management of complex pipelines Implement automated data and code validation tools Assist in troubleshooting production support issues Isolate data issues to maintain quality in our large data setsWhat You'll Bring: 5+ years of experience – ideally with a focus on distributed systems A solid understanding of ETL processes and data quality best practices Curiosity – you dig below the surface and care about how and why things work Creativity – you’re excited by the opportunity to take an idea from concept to implementation Mentorship – you find fulfillment in supporting junior peers and take every opportunity to help them grow Accountability – you say what you will do and do it, delivering work reliably and on time Communication – the ability to present technical insights to both technical and non-technical stakeholdersWhat We Offer: A collaborative environment where everyone's input makes a difference Paid time off Vacation, Personal, Sick days, and Holidays 401k plan with matching Full medical and dental insurance coverageOptionMetrics is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. Further, OptionMetrics will not discriminate against applicants for inquiring about, discussing or disclosing their pay or, in certain circumstances, the pay of their co‐worker, Pay Transparency Nondiscrimination .If you need a reasonable accommodation for any part of the employment process, please contact us by email and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.Pay ranges at OptionMetrics are established based on an analysis of salaries for positions with a similar level of accountability and impact in the relevant labor market. Salary levels are expected to change to reflect an employee’s job performance (results and impact) over time. Salaries at the time of hire are typically offered in the lower to middle of the above-referenced range in order to provide the opportunity to reflect performance-based increases over time. In addition to base salaries, employees at OptionMetrics are eligible for a comprehensive package of benefits.","applicants_count":"未找到","salary_range":"$130,000.00/yr","is_remote":false,"job_criteria":{"Seniority level":"Not Applicable","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Hospitality, Food and Beverage Services, and Retail"},"seniority":"Not Applicable","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Hospitality, Food and Beverage Services, and Retail"},{"job_id":"4217583683","title":"Software Engineer - (Remote - US)","company":"Jobgether","location":"United States","posted_date_attr":"2025-04-29","posted_text":"3 weeks ago","link":"https://www.linkedin.com/jobs/view/software-engineer-remote-us-at-jobgether-4217583683?position=4&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=mrO7NOg%2FKmJ54S2MDRjVJw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4217583683?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"About JobgetherJobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.One of our companies is currently looking for a Software Engineer in United States.We are seeking a skilled and detail-oriented Software Engineer to develop scalable systems that support forecasting, data analytics, and automated decision-making processes. In this role, you will build and optimize high-performance backend systems, work closely with research teams to implement predictive models, and ensure data flows seamlessly across internal and external platforms. You will play a crucial role in developing infrastructure that enables data-driven market operations and ensures reliability and speed across systems. This is a remote-friendly role available from anywhere within the U.S.Accountabilities:Design and build autonomous systems that dynamically allocate resources based on predictive model outputsEnsure system reliability and optimize performance to meet low-latency requirementsDevelop and maintain robust data pipelines to process and integrate information from multiple sourcesCollaborate with research teams to implement forecasting models in scalable environmentsMaintain accurate and organized records of transactions and data logsTroubleshoot and resolve system issues, continuously improving backend architectureRequirementsBachelor's degree in Computer Science, Mathematics, Engineering, or a related disciplineProven experience with distributed systems and backend infrastructureProficiency in SQL/PostgreSQL, Python, and GolangKnowledge of data processing (ETL), forecasting models, and data analyticsStrong ability to work independently and collaborate cross-functionallyExcellent problem-solving and analytical skills with attention to detailBenefitsCompetitive salary range: $130,000 - $210,000/yearFully remote work from anywhere in the U.SOpportunity to work on cutting-edge data-driven systemsInclusive and mission-driven company cultureSupportive environment that values innovation and collaborationEqual opportunity employer committed to diversity and equityJobgether hiring process disclaimerThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.Our AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.Our process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.If you are among the top 5 candidates, you will be notified within 7 days.If you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experience.Thank you for your interest!","applicants_count":"64","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Information Technology","Industries":"Non-profit Organizations and Primary and Secondary Education"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Information Technology","industries":"Non-profit Organizations and Primary and Secondary Education"},{"job_id":"4221388995","title":"Full Stack Developer","company":"Xenith Solutions","location":"Virginia, United States","posted_date_attr":"2025-05-06","posted_text":"2 weeks ago","link":"https://www.linkedin.com/jobs/view/full-stack-developer-at-xenith-solutions-4221388995?position=5&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=iQHCUPRSFjhb1ntJVBxVTA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4221388995?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"Xenith Solutionsis a small family focused business where we focus on taking care of our employees and customers equally. We are focused on serving Federal / Civilian, Defense and Intelligence organizations with superior service. If you want to be a part of a rapidly growing business with an exceptional culture, then you want to be a part of the Xenith Solutions family.Xenith offers unmatched Benefits:100% of Medical, Dental, and Vision benefits paid by employerFSA or HSA availableUnlimited Paid Time Off (PTO)401(k) matching (100% up to the first 4%) with NO vesting periodTuition / Certification / Training reimbursementAccident / Disability / Universal Life InsuranceAnd much more…Job Description:Xenith Solutions is seeking a Full Stack Developer with agile methodology experience to join our team in support of a Customs and Border Protection (CBP) contract. As a member of the team, you will support our prime contractor’s Agile Solution Factory (ASF), which is a passionate team of industry-leading personnel supporting the best practices in Agile Software Development. The ability to be adaptable and to work constructively with a technically diverse and geographically separated team is crucial. You should have worked with or have a strong interest in Agile software development practices and delivering deployable software in short sprints.Serve as an Agile Scrum team member providing software development and maintenance for the delivery of releasable software in short sprint cycles. Responsible for activities associated with delivery of software solutions associated with customer-defined systems and software projects by working in close collaboration with software developers/engineers, stakeholders, and end users within Agile processes.Responsibilities, but not limited to:Designing, developing, and implementing custom software and database application capabilities for a variety of legacy and modernized systems with limited oversightActing as a member of a product team supporting teammates and collaborating with a do what it takes attitude to ensure product and team successProviding improvements to the product(s) being supportedActively participate in release and sprint planning, artifact creation, sprint testing, regression testing, demonstrations and retrospectives and solution releasesSupporting release planning with conceptual design and development / refinement of software engineering guidelinesAnalyzing complex project-related problems and creating innovative solutions involving, scheduling, technology, methodology, tools and solution componentsEnsuring product quality and timeliness of work, providing advice and guidance, resolving problems to meet objectives, and providing periodic performance reportsProviding mentoring to junior members of the teamRequired Qualifications:Must be a U.S. Citizen with the ability to pass CBP background investigation, criteria include but are not limited to:3-year check for felony convictions1-year check for illegal drug use1-year check for misconduct such as theft or fraudCollege degree (B.S.) in Computer Science, Software Engineering, Information Management Systems, or a related discipline. Equivalent professional experience will be considered in lieu of degreeProfessional Experience:Angular 2 or newerProfessional Experience: at least seven (7) years related technical experience, with software design, development, and implementation in a Windows EnvironmentIn-depth knowledge of the Angular framework and Angular MaterialMust have expert experience in the following programming languages/libraries: Angular, Typescript, JavaScript, CSS and HTMLKnowledge of creating Angular components, services, good understanding of state management and UI performanceCreating reusable libraries, develop interactive and responsive interfaces, implement complex solutions, encouraging quality code through conducting reviews/leading tests, and applying beautiful visualizations to solutionsImplement new features by transforming mockups into fully functional user interfaces integrated with API enabled microservice built on Springboot/Java based backendDemonstrated professional experience with developing SPA (Single Page Application) using a modern UI framework (Angular and Angular Material)Ensure technical feasibility of UI/UX designs standards and specsBuild custom reusable UI components as per the style guides and behavior specified in the UI/UX standardsBridge the gap between user interface design and technical implementationPassion for user experience and user-centric developmentContinuously research new and best coding practicesOptimize application for maximum speed and scalabilityStrong communication skills that include leading design-related conversations, ability to build and nurture good relationships and foster an environment for collaborationExperience with Java; Familiarity with any of the following: Springboot, SyncFusion, Hibernate (or other ORM), JAX-RS, JSON, Swagger, Eclipse, maven, jUnit, and shell scriptingDesired Experience:Experience with video streaming technologiesTechnical Certifications, such as OCAJP; OCPJP; OCE, OCM; CSMAbility to apply advanced principles, theories, and concepts, and contribute to the development of innovative principles and ideasExperience with platform conversions (e.g., .NET to Java, etc)DevOps experience / CI/CD pipelineXenith Solutions LLC is a Service-Disabled Veteran-Owned Small Business founded in 2019. We provide comprehensive, timely and relevant Solutions and Business Consulting support to our customers as a key partner. Our leadership brings over a century of combined experience in Defense and Civilian markets. Our employees possess experience in all aspects of solution development from requirements creation, development, test and evaluation, fielding, and sustainment. At the core of our offerings, we provide strategy and technology solutions, giving our customers valuable insights and thought leadership on the best application of information technology to drive business objectives.Xenith focuses on solving complex business challenges facing our customers. Our “Success Through Achievement” work ethic means our customer receive quality solutions through our commitment. We pride ourselves on tackling some of the most difficult operational requirements our customers have – ensuring an appropriate match between the mission requirements, financials, schedule, and security.EEOXenith Solutions provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws.EEO IS THE LAWIf you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact Xenith Solutions.E-VerifyAs a Federal Contractor, Xenith Solutions is required to participate in the E-Verify Program to confirm eligibility to work in the United States.Affirmative Action PlanAs a federal government contractor and based on Executive Orders and applicable laws and regulations, Xenith Solutions develops and maintains annual written Affirmative Action Plans and endeavors to hire and advance qualified minorities, females, individuals with disabilities, and protected veterans.Powered by JazzHRDwRIXqUcdh","applicants_count":"81","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Internet Publishing"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Internet Publishing"},{"job_id":"4185686997","title":"Overseas Software Engineer","company":"Solo","location":"Provo, UT","posted_date_attr":"2025-03-18","posted_text":"2 months ago","link":"https://www.linkedin.com/jobs/view/overseas-software-engineer-at-solo-4185686997?position=6&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=IMRnZWUx8GQd%2BTxwzES50A%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4185686997?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"SoloSuit is Closing the Justice GapSoloSuit helps people resolve debt lawsuits. So far, we’ve helped Americans respond to over $1 billion in debt lawsuits, and we’re just getting started. Over 70 million people are in collections every year, and we want to help every one of them.We’re backed by Kleiner Perkins and Y Combinator, the investors behind Apple, Google, Stripe, and AirBnB. We’re a fast-growing startup and are looking for passionate and talented individuals to join our team and help us drive innovation in this significant and impactful space.You can read about us in TechCrunch, Business Insider, Bloomberg, NPR, ABC, IBT, and FastCompany.You can learn about our mission and principles here.You’ll build software that helps peopleOur software helps Americans through the worst financial pain of their lives. You’ll help build the company alongside our elite engineering team. You’ll have these responsibilities.Ship features that help hundreds of thousands of people (soon to be millions).Execute rapidly.Perform code reviews.Investigate and resolve bugs.Write clean code.Estimate tasks and manage your own workflow.Scope features technically and flesh out their UX design where needed.Collaborate with the engineering, product, operations, and growth teams to execute on our roadmap.Help us decide what to build next.Solve complex problems.Our tech stack includes Ruby on Rails, PostgreSQL, AWS, Heroku, and Bootstrap. Experience in this stack is not required, but you must be down to learn the stack.SoloSuit is fully remote, so this job is fully remote, anywhere in the world. The position is full-time. Compensation is $15-$45 per hour.We’re looking for fast and skilled engineersWe’re looking for someone with these qualifications. This role is ideal for someone who thrives in a fast-paced environment and is excited about the opportunity to build and scale a product that is changing lives.Desires to move uncomfortably fast.Writes clean code.A track record of writing understandable, maintainable, tested, and secure code.Does good code reviews and receives them well.Dedication to fully root causing production issues.0 – 7 years work experience.Believes excellence is the only authority.Discovers reality through data analysis and experimentation.Continuously improves over time.","applicants_count":"未找到","salary_range":"$31,200.00/yr","is_remote":true,"job_criteria":{"Seniority level":"Entry level","Employment type":"Contract","Job function":"Engineering and Information Technology","Industries":"Legal Services"},"seniority":"Entry level","employment_type":"Contract","job_function":"Engineering and Information Technology","industries":"Legal Services"},{"job_id":"4210557360","title":"Backend Engineer II - (Remote - US)","company":"Jobgether","location":"United States","posted_date_attr":"2025-04-15","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/backend-engineer-ii-remote-us-at-jobgether-4210557360?position=7&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=fRLdyp9W7fWIATmEr22xhQ%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4210557360?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"About JobgetherJobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.One of our companies is currently looking for a Backend Engineer II in the United States.We're seeking a Backend Engineer II to help develop and maintain the infrastructure that powers critical business operations. This role will work on a collaborative, cross-functional team focused on building secure, scalable backend systems that support healthcare innovation. You'll be responsible for delivering high-quality code, supporting real-time services, and participating in technical design and development initiatives. If you're passionate about engineering with purpose and want to contribute to solving real-world problems, this opportunity is for you.Accountabilities:Design, build, and maintain robust backend services to support core business functionalityParticipate in an on-call rotation to ensure platform reliability and quick resolution of issuesCollaborate across teams to deliver well-scoped technical solutions and accurate project estimatesProtect user data by implementing best practices for privacy and securityWrite clean, efficient code with long-term scalability in mind, while iterating quicklyContribute ideas for new product features and leverage data to improve outcomesWork with technologies including Python, AWS, Kubernetes, Postgres, and ElasticSearchRequirementsMinimum 3 years of experience building scalable backend systemsProficiency in Python is requiredExperience with event-driven and request-driven microservices architectureStrong understanding of AWS services and hands-on experience with SQLExperience deploying and managing applications in Kubernetes environmentsExposure to TypeScript is a plus but not requiredFamiliarity with Agile methodologies and working in cross-functional teamsAuthorized to work in the U.S. (no sponsorship available for this role)Motivation to improve the healthcare system and work in a mission-driven startupBenefitsCompetitive base salary: $135,000 - $165,000 depending on experienceEquity incentive planComprehensive health benefits including medical, dental, and vision coverageInclusive, mission-first culture with a focus on transparency and growthOpportunities for impact and leadership within a fast-growing companySupportive, remote-friendly work environmentJobgether Hiring Process DisclaimerThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.Our AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.Our process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.If you are among the top 5 candidates, you will be notified within 7 daysIf you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experienceThank you for your interest!","applicants_count":"58","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Information Technology","Industries":"Non-profit Organizations and Primary and Secondary Education"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Information Technology","industries":"Non-profit Organizations and Primary and Secondary Education"},{"job_id":"4121543447","title":"Senior Software Engineer, Back End","company":"Styra","location":"San Francisco, CA","posted_date_attr":"2025-01-10","posted_text":"4 months ago","link":"https://www.linkedin.com/jobs/view/senior-software-engineer-back-end-at-styra-4121543447?position=8&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=Ir5a%2FpvxqaSmt%2Bn8y4jxUw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4121543447?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"At Styra we are creating a new category of services designed to help businesses take control of their cloud operations. We empower people and software to make reliable authorization decisions in dynamic, complex, and large-scale environments with tools that provide direct, real-time visibility and control over applications and infrastructure. Styra is the company behind the extremely fast-growing Open Policy Agent (OPA) open source project – we deliver industry-leading SaaS software, built on OPA, for cloud-native environments.Role OverviewOur team is seeking an experienced Back-End Engineer with a proven track record of designing and delivering world-class products. You will be working on building new features in Golang on top of Styra's state-of-the-art cloud-native platform, solving hard technical problems such as database concurrency, storage, caching, and query optimization.What You Will Do:In this role, you will work closely with the team to:Design and implement APIs to be used by the front-end, CLI, and customer automationImplement high-quality code with test coverageParticipate in design and code reviewsContribute to high-level strategic discussionsUnderstand how to build secure softwarePlay a key role in building out our cloud-native security solutionWhat You Bring to the Team:Great candidates often have these qualifications:BSCS, MSCS or equivalent experience8+ years' experience working as a Software Engineer Proficient in Back-End tools (e.g. Golang, Git, Microservices architecture)A track record for taking features and products from concept to productionExperience writing meaningful unit tests and supporting a full automation strategyPassionate about writing secure, reliable and fast software for a SaaS environmentExcellent communication and presentation skills, both written and oral, as well as exceptional listening skillsKnowledge of cloud-native technologies (Kubernetes, Service Mesh, etc) and experience with Open Policy AgentWhat We OfferThese are only a few highlights of the benefits and perks of working at Styra:Competitive salary and stock optionsFull medical coverage (health, dental, and vision)Phone & Internet reimbursement policyFlexible vacation policyPaid parental leaveFor this role, the estimated base salary is $147,000.00 - $195,000.00. The final compensation package for this role will be determined during the interview process and is based on a variety of factors, including, but not limited to: location, skills, experience and training. This role is also eligible to receive equity, which is not listed in the salary range.We at Styra recognize that people come with a wealth of experience and talent beyond just the requirements of a job. If your experience is close to what you see listed here, please still consider applying. Diversity of experience and skills combined with passion is a key to innovation and excellence; therefore, we encourage people from all backgrounds to apply to positions. Please let us know if you require accommodations during the interview process.","applicants_count":"195","salary_range":"$147,000.00/yr","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Software Development"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development"},{"job_id":"4223292482","title":"Software Engineer","company":"Bamboo Health","location":"United States","posted_date_attr":"2025-05-07","posted_text":"2 weeks ago","link":"https://www.linkedin.com/jobs/view/software-engineer-at-bamboo-health-4223292482?position=9&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=jKKg5s%2BHoUcAbA6D03HlPw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4223292482?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"Bamboo Health is the leader in Real-Time Care Intelligence™ solutions aimed at improving lives for everyone experiencing physical and behavioral health challenges. We are driven by our mission to empower clients to deliver seamless, high-quality and cost-effective care during pivotal moments to improve health outcomes. From coast to coast, Bamboo Health partners with all major retail pharmacy chains, 52 states and territories, 100% of the top 10 best hospitals and more than half of the country’s largest health plans to improve more than 1 billion patient encounters annually. Join us in improving lives during pivotal care moments!SummaryWe are seeking a talented full-time backend Software Engineer to join our team. In this role, you will support and enhance our customer-facing web applications that facilitate care coordination. You will work across all layers of our AI applications and contribute to the development of innovative solutions as we scale and expand our services. The ideal candidate thrives in solving complex problems, enjoys exploring new technologies, and is committed to delivering high-quality, efficient, and elegant solutions.What You’ll DoDeveloping AI-powered applications using Python and SQL in a serverless environment (AWS Lambda, API Gateway).Optimizing and managing databases, writing efficient SQL queries to support AI models and data-driven applications.Working with AWS Bedrock and agentic application development to create intelligent, automated solutions.Collaborating with data scientists and AI engineers to integrate advanced analytics into Bamboo Health’s products.Deploying scalable cloud-based applications while following best practices for security, compliance, and performance.Continuously learning and staying updated on emerging AI, cloud, and automation technologies.What Success Looks Like…In 3 months… Get fully onboarded with Bamboo Health’s Advanced Analytics & AI team and familiarize yourself with our AI-driven applications and development processes. Gain hands-on experience with Python, SQL, and serverless computing using AWS Lambda and API Gateway. Begin contributing to small-scale projects, such as writing and optimizing SQL queries and assisting in the development of AI-powered solutions.In 6 months… Take ownership of end-to-end development tasks, including building and maintaining serverless applications. Gain deeper expertise in AWS Bedrock and agentic application development and begin integrating AI-driven components into our solutions. Collaborate with data scientists and AI engineers to deploy AI models into production environments. Contribute to process improvements and identify opportunities to optimize code and workflows.In 12 months… Lead development efforts on AI-powered features and enhancements for Bamboo Health’s products. Build and maintain scalable, high-performance applications leveraging serverless computing and cloud infrastructure. Become a key contributor in shaping the team’s best practices, security standards, and cloud deployment strategies. Mentor new team members and actively participate in team knowledge-sharing sessions.What You Need 2+ years of experience in software development, AI, or cloud-based application development. Proficiency in Python and SQL for building and optimizing applications. Familiarity with serverless computing (AWS Lambda, API Gateway, Step Functions). Interest in AWS Bedrock and agentic application development (hands-on experience is a plus). Strong problem-solving skills and ability to work in a collaborative, fast-paced environment. Willingness to learn new technologies and adapt to evolving AI and cloud trends. Strong analytical and problem-solving skills, with a high level of judgment and creativity in designing innovative solutions. Demonstrated ability to thrive in fast-paced, high-growth, and rapidly evolving environments. A remote work environment that supports high-quality virtual interactions with minimal distractions. Ability to work effectively in a remote-first environment, ensuring high-quality virtual interactions with minimal distractions.What You Get Join one of the most innovative healthcare technology companies in the country. Have the autonomy to build something with an enthusiastically supportive team. Learn from working at the highest levels and on the most strategic priorities of the company, including from world class investors and advisors. Receive competitive compensation including health, dental, vision and other benefits.Belonging at BambooWe Care. #BambooHealthValuesCareEvery human being has the right to the best possible healthcare. Our solutions enable healthcare professionals to see and treat every individual as a whole person by providing the right information, at the right time – regardless of physical, behavioral, or social barriers.We’re a great place to work because we care. We continually seek to learn about our differences and ensure the unique identities and contributions of all employees are welcome, valued and celebrated.Our commitment to making a positive impact starts by recognizing and leveraging our differences, building inclusive teams, cultivating a sense of belonging, combating biases, and actively removing barriers to equity.Bamboo Health is proud to be an Equal Employment Opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.To protect our applicants from fraudulent recruitment activity, we recommend that all applicants verify the validity of an interview and hiring process by visiting our website www.bamboohealth.com. All valid job postings will be listed on our careers page. Bamboo Health does not conduct interviews via text and will not request sensitive information such as banking details during the application process.","applicants_count":"79","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Hospitals and Health Care"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Hospitals and Health Care"},{"job_id":"4229650535","title":"Software Engineer (Remote - US)","company":"Jobgether","location":"United States","posted_date_attr":"2025-05-14","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-remote-us-at-jobgether-4229650535?position=10&pageNum=37&refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D&trackingId=JgQiHFT4%2B6dOc8sZUeFeQg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4229650535?refId=%2F4ekoEXvgmAcuILffwBcBw%3D%3D","ref_id":"/4ekoEXvgmAcuILffwBcBw==","job_description":"About Jobgether:Jobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.One of our companies is currently looking for a Software Engineer in the United States.We are looking for a highly skilled Software Engineer to design, build, and optimize systems that drive decision-making and liquidity operations in a trading platform. You'll collaborate closely with data scientists and researchers to implement complex forecasting models into scalable, low-latency systems. The role involves developing robust data pipelines, managing distributed systems, and maintaining structured trading records. If you're driven by data, performance, and systems architecture—and you're eager to work on cutting-edge, autonomous trading technology—this is an excellent opportunity to take your engineering skills to the next level.Accountabilities:Develop autonomous systems to allocate liquidity based on predictive algorithmsOptimize system performance for low-latency, high-reliability operationsIntegrate external and internal data sources into unified storage and analytics pipelinesCollaborate with research teams to implement forecasting models at scaleEnsure consistent, accurate record-keeping of executed tradesContribute to overall architecture, design, and scalability of backend systemsRequirementsBachelor's degree in Computer Science, Mathematics, Engineering, or related fieldStrong knowledge of distributed systems and backend infrastructureProficiency in Python and GolangExperience with data pipelines, ETL processes, and data modelingSolid skills in SQL and PostgreSQL for managing and querying large datasetsFamiliarity with data analytics and forecasting modelsAbility to work remotely from anywhere in the United StatesBenefitsCompetitive salary: $130,000-$210,000/yearFully remote work flexibility within the USOpportunity to work on cutting-edge financial systemsCollaborative environment with researchers and data scientistsInclusive and mission-driven company cultureEqual opportunity employer committed to diversity and inclusionJobgether hiring process disclaimerThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.Our AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.Our process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.If you are among the top 5 candidates, you will be notified within 7 days.If you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experience.Thank you for your interest!","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Information Technology","Industries":"Non-profit Organizations and Primary and Secondary Education"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Information Technology","industries":"Non-profit Organizations and Primary and Secondary Education"},{"job_id":"4218831631","title":"Full-Stack Engineer","company":"Navia Benefit Solutions, Inc.","location":"United States","posted_date_attr":"2025-04-30","posted_text":"3 weeks ago","link":"https://www.linkedin.com/jobs/view/full-stack-engineer-at-navia-benefit-solutions-inc-4218831631?position=1&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=G2Q%2FmUT0LPlcrXEOhUxigg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4218831631?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"Full-Stack EngineerCome join a highly successful privately held third-partly administrator of FSA plans that has been serving customers since 1989. We’ve grown from humble beginnings to be considered one of the premier administrators on the West Coast with a national reach of clients from coast to coast. Over time, even with our increase in service offerings and overall growth, we’ve maintained the qualities and principals that the company was founded on, respect, communication, and treating clients and participants like family.Our key to success is our leading-edge technology infrastructure. We are looking for a .Net programmer to help build the next version of our internal systems and website. You will work on our back-end systems (.Net 4.8 (C#), WebAPI, SQL and NoSql database) with opportunity to also do front-end web programmingIn this role you’ll be challenged greatly, and you’ll also experience the closeness and camaraderie of working in small team. You will be able to influence the technology decisions that we are making, and you’ll be able to spend most of your time coding, and not in meetings. Expect great work-life balance.Requirements:Angular or similar technology (2+ years experience)C# 2+ years’ experienceASP.Net Web APIMicrosoft Entity FrameworkSSO / SAML ExperienceMicrosoft Azure / DevOps or similar experienceMicrosoft SQL programming (stored procedures, triggers, queries)Relational database design (table design, queries)Experience developing Web Services (REST w/ JSON, Oauth) and working with related standardsAgile development experienceJIRA or other issue/bug tracking systemAble to work as a team, and individually, on a projectExcellent troubleshooting and debugging skillsStrong written and verbal communication skillsSalary: $110,000-$120,000","applicants_count":"未找到","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Financial Services, Software Development, and Technology, Information and Internet"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services, Software Development, and Technology, Information and Internet"},{"job_id":"4201406806","title":"Full Stack Developer, AI and LLM","company":"NVIDIA","location":"California, United States","posted_date_attr":"2025-05-18","posted_text":"2 days ago","link":"https://www.linkedin.com/jobs/view/full-stack-developer-ai-and-llm-at-nvidia-4201406806?position=2&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=oXVDULdvzSWSzC%2BRpJ4a6g%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4201406806?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"NVIDIA's Silicon Solutions Group is seeking a full-stack developer with AI/LLM expertise to help integrate AI into its data analysis and automation infrastructure. The solutions developed will support multiple critical large-scale automation initiatives. In this role, you will lead strategies and design of AI solutions to improve the efficiency of our existing and new automation workflows. The ideal candidate will combine technical expertise with hands-on experience to drive all AI planning, design, and implementation aspects. At NVIDIA, we strive for excellence, encourage innovation, and provide opportunities to explore new ways to succeed!What You'll Be Doing Study and develop groundbreaking techniques in deep learning, graphs, machine learning, and data analytics, and perform in-depth analysis.  Collaborate with developers and cross-functional teams to identify current and emerging challenges.  Design and implement end-to-end generative AI solutions, specializing in Large Language Model (LLM) training, efficient deployment strategies, and sophisticated Retrieval-Augmented Generation (RAG) workflows. What We Need To See MS (or equivalent experience) with 12+ years of software development; 8+ years relevant work experience in developing and deploying AI solutions  Proven full-stack development experience with a focus on improving application performance and user experience  Proficiency in Python, C++ programming, and Deep Learning frameworks  Ability to work independently and as part of a team  Motivated self-starter with strong analytical and debug skills  Ability to balance multiple simultaneous projects  Excellent verbal and written communication skills Ways To Standout From The Crowd Experience with CUDA programming and benchmarking and analyzing performance AI Agentic systems  Expertise in training, fine-tuning, and evaluating LLMs using popular frameworks such as TensorFlow or PyTorch  Proficiency in model deployment and optimization techniques for efficient inference on various hardware platforms  Experience with NVIDIA GPUs and software libraries, such as NVIDIA NeMo Framework, NVIDIA Triton Inference Server, TensorRT, TensorRT-LLM  Proficiency in model deployment and optimization techniques for efficient inference on various hardware platformsNVIDIA is widely considered to be one of the world's most desirable employers in the technology field. We have some of the most forward-thinking and hardworking people in the world working for us. If you're creative and autonomous, we want to hear from you!The base salary range is 224,000 USD - 425,500 USD. Your base salary will be determined based on your location, experience, and the pay of employees in similar positions.You will also be eligible for equity and benefits .  NVIDIA accepts applications on an ongoing basis. NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.JR1996169","applicants_count":"43","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering","Industries":"Computer Hardware Manufacturing, Software Development, and Computers and Electronics Manufacturing"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering","industries":"Computer Hardware Manufacturing, Software Development, and Computers and Electronics Manufacturing"},{"job_id":"4142865314","title":"Full Stack Engineer","company":"CNDUIT","location":"United States","posted_date_attr":"2025-02-28","posted_text":"2 months ago","link":"https://www.linkedin.com/jobs/view/full-stack-engineer-at-cnduit-4142865314?position=3&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=vnNN%2By933ZkDscbvStIY1w%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4142865314?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"About Perfect HarvestPerfect Harvest LLC is a leading management provider in the cannabis industry that focuses primarily on cannabis cultivation. We design, operate, and consult for facilities across the country and pride ourselves on working alongside industry leaders. We are seeking driven, detail oriented, and positive individuals to join our team. Join our team today to experience personal growth and career opportunities in an expanding industry!The RoleWe are seeking a highly skilled Full Stack Developer to join our team in a pivotal role focused on enhancing operational efficiency and integrating AI-driven technologies directly into our business processes. Working closely with our CTO and technical team, you will develop and optimize solutions that drive profitability, automation, and scalability across our operations.ResponsibilitiesDevelop and maintain serverless applications using Firebase Functions and Google Cloud Platform.Implement and manage NoSQL and SQL databases, ensuring data integrity and performance.Collaborate with product and design teams to create intuitive and responsive user interfaces using modern JavaScript frameworks.Utilize TypeScript for building robust and type-safe applications.Write and maintain efficient, reusable, and reliable code.Conduct code reviews and provide constructive feedback to peers.Troubleshoot and resolve application issues, ensuring high performance and responsiveness.Participate in Agile development processes, contributing to sprint planning and retrospectives.Key Technologies:Proficiency in JavaScript frameworks such as React, Angular, or Vue.js.Experience with Node.js, Express, and Firebase Functions.Strong knowledge of NoSQL Databases (Mongo DB, Firestore, etc) and SQL databases (mySQL, PostgreSQL, etc)Proficiency in TypeScript and JavaScript.Familiarity with date-fns for date manipulation and Prisma for database management.Experience with Google Cloud Platform and serverless architecture.Proficient in using Git for version control.Qualifications:Bachelor’s degree in Computer Science, Engineering, or a related field, or equivalent experience.Proven experience as a Full Stack Developer or similar role.Strong understanding of serverless architecture and cloud services.Experience with RESTful APIs and third-party integrations.Familiarity with Agile development methodologies.Excellent problem-solving skills and attention to detail.Strong communication and teamwork skills.Preferred SkillsExperience with CI/CD pipelines and DevOps practices.Knowledge of data modeling and database design.Familiarity with environment configuration and management","applicants_count":"未找到","salary_range":"$110,000.00/yr","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Business Consulting and Services"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Business Consulting and Services"},{"job_id":"3860727548","title":"Front-End Engineer (Anime)","company":"Spellbrush","location":"San Francisco, CA","posted_date_attr":"2024-03-17","posted_text":"1 year ago","link":"https://www.linkedin.com/jobs/view/front-end-engineer-anime-at-spellbrush-3860727548?position=4&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=fXcJSDnmbZPsQPDygVOe6Q%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/3860727548?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"Here at Spellbrush, we're passionate about making a good anime game.We also happen to be the world's leading generative AI studio — we're the team behind niji・journey.We are currently investigating how AI can be used to help human artists perform masterpieces in the most complex medium of our times: videogames.Our games are characterized by a no-compromise approach to well-balanced gameplay married to a truthful love of visual arts.If you love turn-based tactics games, please consider applying!The Frontend Role:We're seeking a talented Front-End Engineer to join our team and help us build the next generation of anime and video game tools. You'll be responsible for designing and developing complex front-end applications, usually in react and typescript, with a focus on making responsive and delightful user interfaces.You may be a good fit if:You love anime and the anime aestheticAs a member of our team, you'll have the opportunity to push the boundaries of what's possible in the anime and video game industry. Ideally you're a fan of the genre.You enjoy working on complex SPAs.Most of our apps are interaction-heavy single-page editors, much closer in spirit to photoshop and blender than your typical SaaS app. A willingness to dive headfirst into canvas, webGL, and (maybe!) webGPU is recommended!And you also have some design sense.Large complex SPAs have all sorts of super interesting UI/UX challenges! We're looking for someone with experience building tasteful UI, a good design sense for layout, experiences, and microinteractions.You're comfortable working on small, fast-paced teamsWe currently have a tiny team of three on frontend engineering. You'll be working directly with some of the best AI researchers in the world to integrate their state-of-the-art models into your beautiful interfaces.We also believe in the unmatched speed of in-person teams, and prefer on-site collaboration in either our primary research office in Tokyo (downtown Akihabara) or San Francisco. Visa sponsorships are available.","applicants_count":"未找到","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Computer Games"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Computer Games"},{"job_id":"4193042800","title":"Software Engineer (L4/L5), Android Games SDK","company":"Netflix","location":"United States","posted_date_attr":"2025-05-13","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-l4-l5-android-games-sdk-at-netflix-4193042800?position=5&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=DXayEzel1cC24Y9MbDdHDg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4193042800?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.The Games Developer Platform team is on a mission to delight members by empowering Game Developers to do the best work of their lives and bridge Netflix’s unique superpowers and technologies to the vibrant, complex world of Gaming. We are looking for a Software Engineer with Android expertise to work on our Games SDK to help us evolve the way people develop and play games. You will play a pivotal role in building the products and features that enable game developers to integrate their games into the Netflix service. In the process, you will help create an immersive environment for Netflix members to discover and play games.What you will doDevelop product features and foundational infrastructure for the Android Games SDK and corresponding bindings to common game engine plugins (Unity, Unreal)Collaborate cross-functionally with product, design, and engineering partners to scope project roadmaps and build functionality to level up our game development experienceEngage with game development partners to understand developer pain points and troubleshoot issues, and drive prioritization and execution of the right solutionsArchitect maintainable, performant Android client code with effective documentationDesign code for testability and write automated tests to help uphold product qualityWhat sets you apartYou are comfortable with some degree of uncertainty and ambiguity. The Netflix Games Platform is evolving quickly as we learn what drives member joy in the gaming space.You exude developer empathy. You have great intuition for making a clean, easy-to-use API for game developers to integrate Netflix services. You thrive on cross-functional collaboration. You have excellent communication skills and can translate objectives and concerns between different teams, creating greater alignment between all the stakeholders on a project.You are self-motivated. You proactively look for solutions to bridge the needs of the business with technology.You have strong analytical skills. You are adept at analyzing data to gain insights that drive improvements in product quality.What Skills Are Important To UsWe value aptitude over experience, but here are some key skills that will make you successful on this team:Exceptional coding skills, especially with Kotlin and Java, and proficiency in navigating different languages and technology stacksExperience developing third-party SDKsDeep understanding of the technical landscape of Android development and can introduce new paradigms and practicesExperience building and extending secure, scalable client-server communications (GraphQL knowledge a plus)Experience writing automated tests and using them to power short feedback cycles in a continuous integration environmentExperience with game engines such as Unity and Unreal, native plugins, and bindingsAt Netflix, we carefully consider a wide range of compensation factors to determine your personal top of market. We rely on market indicators to determine compensation and consider your specific job, skills, and experience to get it right. These considerations can cause your compensation to vary and will also be dependent on your location.The overall market range for roles in this area of Netflix is typically $100,000 - $720,000.This market range is based on total compensation (vs. only base salary), which is in line with our compensation philosophy. Netflix is a unique culture and environment. Learn more here.Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.Job is open for no less than 7 days and will be removed when the position is filled.","applicants_count":"35","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Not Applicable","Employment type":"Full-time","Job function":"Other","Industries":"Entertainment Providers"},"seniority":"Not Applicable","employment_type":"Full-time","job_function":"Other","industries":"Entertainment Providers"},{"job_id":"4225688152","title":"Backend Engineer","company":"Data Ideology","location":"United States","posted_date_attr":"2025-05-12","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/backend-engineer-at-data-ideology-4225688152?position=6&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=h%2Bd%2FXbZPRotpKC9KGWZnxQ%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4225688152?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"Data Ideology At DI, we provide Data & Analytics expertise to drive measurable business outcomes, often solving complex business problems for our clients. Our data analytics advisory services enable our customers to transform data into insights by driving a culture of empowerment and ownership of results. Our team consists of highly motivated individuals passionate about learning, understanding, collaborating, and intellectually curious.  For more information about Data Ideology, visit www.dataideology.com  Backend Engineer – ContractResponsibilitiesTo perform in this position successfully, an individual must be able to perform each essential duty satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions. Other duties may be assigned to meet business needs.Develop and maintain backend systems and services using C# and .NET technologies.Work within a microservices architecture, ensuring high-quality, scalable solutions.Design and implement RESTful APIs and Web Services for integration across systems.Ensure robust unit testing and implementation of proper debugging techniques.Develop applications using Azure ServiceBus and integrate with cloud-based infrastructure.Collaborate with cross-functional teams to understand business objectives and contribute to product design.Maintain and optimize SQL databases, ensuring data integrity and high performance.Participate in code reviews and provide mentorship to junior developers.Continuously improve the development process by adopting new tools and practices.Assist in the deployment and management of services using Azure DevOps, Azure Repos, and related tools.Supervisory Responsibilities: NoneQualificationsEducation and Experience:Bachelor's Degree in Computer Science or a related field with 5+ years of relevant experienceProven experience as a Backend Engineer, Software Engineer, or in a similar role, with a strong focus on backend development.Solid experience with C# and .NET Framework/Core.Familiarity with cloud services, specifically Azure.Experience working with microservices architectures and RESTful APIs.Experience with SQL and relational databases.Knowledge, Skills, and Abilities:Strong understanding of object-oriented programming concepts.Proficiency in unit testing and debugging techniques in C#.Familiarity with Azure ServiceBus and Azure DevOps pipelines.Experience with tools like Postman, Swagger, and SQL Server Management Studio.Experience with source control tools, particularly GitHub and Azure Repos.Knowledge of modern cloud-based application architecture.Understanding of microservices and containerization practices (Azure Kubernetes Service is a plus).NoSQL experience is beneficial.Strong problem-solving and collaboration skills.Required Tools Experience:ASP.NET, .NET Framework, .NET 8C#Web APIVisual StudioAzureSQL stored procedures and relational dataCosmos DBSwagger / Postman / API Debugging skillsWork Environment:Remote work from home.Hours of work and days are generally Monday through Friday. Specific business hours will depend on client needs.Physical Demands:Must be able to remain in a stationary position 50% of the time.The person in this position must occasionally move about inside the office to access file cabinets, library stacks, office machinery, etc.Constantly operates a computer and other office productivity machinery, such as a calculator, copy machine, and printer.The person in this position frequently communicates with clients and coworkers. Must be able to exchange accurate information in these situations.Data Ideology is an EEO Employer","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Financial Services, Software Development, and Technology, Information and Internet"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services, Software Development, and Technology, Information and Internet"},{"job_id":"4226692932","title":"Software Engineer - Integrations and Developer Experience team","company":"Fingerprint","location":"New York, NY","posted_date_attr":"2025-05-09","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-integrations-and-developer-experience-team-at-fingerprint-4226692932?position=7&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=jwvsAUjyIC3peI%2Bf24oSrw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4226692932?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"Fingerprint empowers developers to stop online fraud at the source.We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100% remote company with a strong open-source focus. Our flagship open-source project is FingerprintJS (20K stars on GitHub).We have raised $77M and are backed by Craft Ventures (previously invested in Tesla, Facebook, Airbnb ), Nexus Venture Partners (previously invested in Postman, Apollo.io, MinIO, Druva) and Uncorrelated Ventures (previously invested in Redis, Rollbar & Gradle).We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates' personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.As a Software Engineer on the Developer Experience and Integrations team, you will be responsible for building and maintaining customer-facing integrations between Fingerprint and third-party cloud providers, such as Cloudflare, AWS, Fastly, and Akamai. Your work will enable customers to seamlessly integrate Fingerprint's device intelligence solutions into their existing infrastructure, enhancing security not only for authentication but for any critical action or transaction that requires protection.You will contribute to both backend integrations (Cloudflare Workers, AWS Lambda, API-driven security measures) and customer-facing features in our dashboard, which is primarily written in React and Node.js, with some backend services in Go. Additionally, you will play a key role in maintaining and improving our open-source ecosystem, including a wide range of Server API SDKs, frontend libraries, and mobile libraries.Your code will be executed millions of times daily, ensuring accurate device intelligence and seamless protection for our customers' most sensitive workflows.Responsibilities:Develop and maintain customer-facing integrations between Fingerprint and cloud platforms like Cloudflare, AWS, Akamai, and Fastly.Enhance the Fingerprint dashboard (React, Node.js) to provide customers with intuitive ways to configure integrations.Implement API-based and edge-based security logic, ensuring seamless communication between Fingerprint, cloud services, and customers' infrastructure.Maintain and improve our open-source ecosystem, including Server API SDKs, frontend libraries, and mobile libraries to ensure seamless developer adoption.Work with SDKs and open-source projects that enable customers to integrate Fingerprint's device intelligence into their workflows.Collaborate with product managers, engineers, and designers to improve customer experience and technical performance.Write internal and public documentation to guide customers in integrating Fingerprint with third-party cloud platforms.Qualifications:3-5 years of experience with at least a subset of the following technologies: JavaScript, TypeScript, Java, Go.2-3 years of experience working with Cloudflare Workers, AWS Lambda, or similar edge computing platforms.Experience integrating third-party services and APIs.Experience working on customer-facing products, such as dashboards, SDKs, or developer tools.Familiarity with SDK and library development.Ability to work asynchronously in a remote-based team, with excellent communication skills and attention to detail.Deep interest in cloud platforms, open-source development, and developer experience.To demonstrate your attention to detail, please include the current major version of the Fingerprint Pro Server Python SDK into the box belowNice to have:Experience working with additional cloud platforms, such as Akamai, Fastly, Azure Functions.Contributions to open-source projects or published technical content related to integrations.Experience in technical writing for API and integration documentation.This role is ideal for someone passionate about customer-facing integrations, cloud security, edge computing, and developer experience, while also maintaining and improving our open-source ecosystem and existing integrations.We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates' personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.Due to regulatory and security reasons, there's a small number of countries where we cannot have Fingerprint teammates based. Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location.We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.If you are applying as a resident of California, please read our CCPA notice hereIf you are applying as a resident of the EU, please read our GDPR notice here","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Software Development"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development"},{"job_id":"4224068260","title":"Full Stack React JS Developer","company":"The Dignify Solutions, LLC","location":"Hamilton Township, NJ","posted_date_attr":"2025-04-11","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/full-stack-react-js-developer-at-the-dignify-solutions-llc-4224068260?position=8&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=8%2BBElEGqlI2sLq797OocXg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4224068260?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"Full Stack DeveloperWork independently with very minimum supervision. Work with clients and deliver quickly. Designing and developing web applications using React JSWrite clean and functional codeBuild the front-end of applications through appealing visual designBuild features and applications with a mobile responsive designEnsure cross-platform compatibility and fixing issues during test and production phasesTransform business needs into a finished product from conception to implementation","applicants_count":"44","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Other","Industries":"IT Services and IT Consulting"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Other","industries":"IT Services and IT Consulting"},{"job_id":"4217366331","title":"Back End Developer","company":"The Planet Group","location":"United States","posted_date_attr":"2025-04-29","posted_text":"3 weeks ago","link":"https://www.linkedin.com/jobs/view/back-end-developer-at-the-planet-group-4217366331?position=9&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=gXA8U5irF01WCygTyhnAEA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4217366331?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"W2 Only, NO C2C / 1099Duration: 6 months to startLocation: Remote - PST hoursRate - 60-65/hour W2Interview:45 min Hiring Manager Behavioral interview60 min backend programming interview (live coding test)60 min systems design architecture interviewQualifications for this role:Minimum 8+ years of post-internship, full-time, hands-on, professional software development experience developing distributed backend systems at scale.Expertise in Python and GolangExperience with distributed systems, microservices architecture, and handling high-throughput workloadsFamiliarity with software engineering best practices such as unit/integration/end-to-end testing, design documents, CI/CD, A/B testing, code reviews, and documentationStrong organizational skills, the ability to prioritize tasks and keep projects on schedule.Excellent communication skills. You collaborate effectively with teams in a fully remote environment and discuss complex topics with technical and non-technical audiences.BS degree in Computer Science, a similar technical field of study or equivalent practical, professional, hands-on experience.You love to build new things and thrive in ambiguity and even failure. You care about innovation.","applicants_count":"77","salary_range":"$60.00/hr","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Contract","Job function":"Engineering","Industries":"Social Networking Platforms and Technology, Information and Media"},"seniority":"Mid-Senior level","employment_type":"Contract","job_function":"Engineering","industries":"Social Networking Platforms and Technology, Information and Media"},{"job_id":"4225648823","title":"Software Engineer (Remote - Texas or Colorado)","company":"Jobgether","location":"Colorado, United States","posted_date_attr":"2025-05-12","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-remote-texas-or-colorado-at-jobgether-4225648823?position=10&pageNum=40&refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D&trackingId=7fLdtkqLS0AKOs%2BFOBz48g%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4225648823?refId=zrPYhtfld60HXDltA%2Ff6Og%3D%3D","ref_id":"zrPYhtfld60HXDltA/f6Og==","job_description":"About JobgetherJobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.One of our companies is currently looking for a Software Engineer in Texas or Colorado.This is a great opportunity for a frontend-focused Software Engineer eager to work on high-impact, scalable systems in a remote-first environment. You'll join a team building platform-level services—like Authentication, Authorization, and Messaging—that support a wide range of product teams. You'll collaborate closely with engineers, product managers, and designers to implement secure, efficient, and user-centric systems. The ideal candidate is passionate about solving technical challenges, contributing to a collaborative team culture, and mentoring fellow engineers along the way.Accountabilities:Develop and maintain frontend services for authentication, authorization, and customer provisioningCollaborate cross-functionally with platform, infrastructure, and data teams to deliver secure and scalable solutionsCoordinate the design and deployment of complex features across microservice architecturesIncorporate user feedback to continuously improve performance, usability, and securityContribute to team growth by mentoring engineers and sharing best practicesDrive ownership of critical components and technical projects from conception to deliveryRequirements3+ years of experience in developing and maintaining high-volume production servicesProficiency in React and TypeScript, with working knowledge of Java, Kotlin, or GoSolid understanding of modern cloud environments, preferably AWS and KubernetesExperience working with relational databases such as PostgreSQLFamiliarity with Git, CI/CD pipelines, and agile development workflowsAbility to work independently and collaboratively in a fast-paced, remote-first environmentStrong problem-solving mindset with attention to detail and a passion for clean, maintainable codeBenefits100% remote work from Austin, TX or Denver, COCompetitive base salary between $125,000 and $148,000 (based on experience and location)Equity options for qualifying positionsComprehensive health and wellness coveragePaid time off and flexible working hoursRetirement planning options and financial wellness supportA diverse and inclusive team environment that values ownership, collaboration, and innovationJobgether hiring process disclaimerThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.Our AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.Our process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.If you are among the top 5 candidates, you will be notified within 7 days.If you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experience.Thank you for your interest!","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Information Technology","Industries":"Non-profit Organizations and Primary and Secondary Education"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Information Technology","industries":"Non-profit Organizations and Primary and Secondary Education"},{"job_id":"4219062930","title":"Back-end Engineer","company":"IronArch Technology","location":"United States","posted_date_attr":"2025-04-28","posted_text":"3 weeks ago","link":"https://www.linkedin.com/jobs/view/back-end-engineer-at-ironarch-technology-4219062930?position=1&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=JLQ4Sk9ZAun8hxE2NNlWGQ%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4219062930?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"DescriptionWho We AreKnown for being a Best Place to Work and a People First company, IronArch Technology is an award-winning Service-Disabled Veteran-Owned Small Business (SDVOSB) specializing in providing innovative solutions and world class services to Federal Government clients.Our employees have voted us as a 'Best Place to Work' 8 times and we are an INC 5000 recipient for being one of the fastest growing businesses in the United States.Our Values: People First, Servant Leadership, Deliver and Inspire Excellence, Do the right thing!What You’ll DoIn this role, you will serve as an experienced individual contributor within a team, with the expectation that you will further develop your leadership, guidance, and mentoring skills. With minimal oversight from leadership, you will be responsible for supporting the goal of meeting scope, schedule, and delivery requirements. A Back-end Software Engineer impacts the long-term goals of the program, while contributing to the implementation of the program’s development strategy. You may serve as the discipline's primary lead when working with stakeholders and utilize strong influential skills to drive improvements in software engineering processes and practices.Primary expectations of a Back-end Software EngineerDemonstrates expertise, accountability, and ownership of their contributions to an application code baseMaintains a high-level understanding of adjacent technical areas and ecosystems to effectively coordinate integration with those systemsDiagnoses and effectively resolves issues with the systems they own, using incidents to inform educational opportunities and system improvementsActively mentors and assists more junior engineers in the development of their skillsEffectively communicates technical issues and developments with team members and clientsParticipates in technical interviews with new candidatesStrong influential skills to propose and evaluate multiple approaches to technical and process problemsMay serve as a mentor to individuals within the teamMay lead small, less critical, or temporary team structures and projectsPresents design documents, system diagrams, etc. to clients, stakeholders, partners, and other engineersRequirementsBachelor’s degree and 7+ years of engineering experienceRelevant years of experience may be substituted for educationDemonstrates expert-level knowledge in backend engineering, showcasing advanced technical skills and deep expertise Experience with Java, AWS and Ruby on RailsAbility to obtain Public Trust clearanceWhy IronArch Technology?Awarded Best Place to Work 8 times!Competitive compensation and market-leading bonus opportunitiesMedical, dental and vision benefits where a significant portion of the premium is subsidized by IronArch. For qualifying high deductible health plans, IronArch also contributes towards a Health Reimbursement Account to cover eligible medical expensesCompany-provided healthcare concierge assistance to help explain your coverage in plain language; help you find, choose, and schedule quality care; and address billing, benefit, or claims concerns, potentially saving hours of your time401(k) retirement plan where the company contributes dollar for dollar up to 3 percent, and 50 cents on the dollar for the 4th and 5th percent with immediate entry and immediate vesting20 days of PTO accumulated per calendar year11 paid holidaysBereavement, jury duty, parental (maternity/paternity/adoption), and military leavesSabbatical programsCompany-paid short- and long-term disabilityCompany-paid life insuranceVoluntary life, accidental and indemnity income replacement benefitsProfessional development reimbursementHealth club reimbursementMatching donation program and annual philanthropic activities Pet insuranceAnd more!Apply today to learn why IronArch Technology has been recognized as “Best Place to Work” for 8 years!IronArch Technology is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law.In alignment with applicable state and local pay transparency laws, IronArch includes a salary range in our job descriptions to support equity and transparency in our hiring process. The compensation range provided reflects what we reasonably expect to offer for this role, with the final offer determined by a variety of factors including skills, experience, and scope of responsibilities.Salary Description$123,600-140,000","applicants_count":"未找到","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Information Technology & Services"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Information Technology & Services"},{"job_id":"4227690395","title":"Web Development Intern","company":"CALSTART","location":"United States","posted_date_attr":"2025-05-14","posted_text":"6 days ago","link":"https://www.linkedin.com/jobs/view/web-development-intern-at-calstart-4227690395?position=2&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=u34G%2Fbt0oGZ%2Bp7LBvfnZaw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4227690395?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"Please be aware of recruiting scams! All legitimate communication from our recruitment team will come from an official calstart.org email address via email, we will not text you about a role you have not applied to or shown interest in. We will not perform any interviews via text or Zoom chat.CALSTART does not ask for any fees or personal information such as social security numbers or bank details during the recruitment process.About Us :CALSTART is a mission-driven industry organization focused on transportation decarbonization and clean air for all.For over 30 years, it’s been CALSTART’s mission to develop, assess, and implement large-scale, zero-emission transportation solutions to mitigate climate change and support economic growth. CALSTART works with businesses, organizations, governments, and communities to create real-life impact toward clean air and equitable access to clean transportation for all. CALSTART provides scientific, technical and policy support for regulatory development and clean technology and infrastructure acceleration.About The Role:CALSTART is seeking an individual who will execute content updates across multiple websites managed by CALSTART's web team, learning to collaborate with UI/UX designers, front & backend developers, and marketing teams. Before the end of the internship, this candidate will have developed at least one deliverable with the guidance of the web team, this can be a back-end element, a landing page, or something with a similar level of complexity depending on the intern's interests and available work.What You'll Do:Execution of content updates for: californiahvip.org , californiacore.org , electricschoolbusnetwork.org , zeroemissiontrucks.org , calfleetadvisor.org , cleantransitnetwork.org , chargeatwork.org , ridecleanmass.org , massfleetadvisor.org , calstart.org Collaborate with web team on landing page development, wireframe reviews, and other web-development related tasks What You'll Bring To The TableProficiency in front-end languages (HTML, CSS, JavaScript) Familiarity with WordPress development and GitHub Communicating complex topics to non-SMEs, attention to detail What You'll Bring To The TableStudent or recent associate/bachelor's graduate in Web Design, Web Development, Computer Science, Information Technology or similar. $16 - $21 an hourCALSTART values transparency and strives to provide as much information regarding compensation as possible. The complete salary range for this role is $16-$21/hr.  Pay is determined based on several factors, including but not limited to job-related skills, qualifications, experience, education, internal equity, and other factors relevant to the job.We understand that not everyone will match the above qualifications 100%. If your background isn't perfectly aligned but you feel you would be a great addition to the team, we'd love to hear from you.We're a tight-knit team of world-class innovators, business minds, and change agents who believe passionately in our mission and put our team ahead of self. We are committed to the continued development and growth of our employees and invest in your success!We care about your personal well being as much as your professional success and offer generous benefits to full time employees including: 100% company paid comprehensive health benefits for Medical, Dental, Vision, Short Term Disability, Long Term Disability and Life Insurance, Retirement plan with generous company contributions, FSA for Health and Dependent Care, 3 weeks of vacation time in the first year of employment, 11 paid company holidays, paid sick time, paid family leave, and more!Our inclusive environment focuses on making decisions based on merit without regard to race, color, hair texture, gender, religion, age, nationality, social or ethnic origin, sexual orientation, gender identity, gender expression, LGBTQIA+ status, marital status, pregnancy, disability, genetics, veteran status, or any other characteristic protected by law.","applicants_count":"未找到","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Internship","Employment type":"Internship","Job function":"Engineering and Information Technology","Industries":"Non-profit Organizations"},"seniority":"Internship","employment_type":"Internship","job_function":"Engineering and Information Technology","industries":"Non-profit Organizations"},{"job_id":"4224062777","title":"Front-End Software Developer - Remote","company":"The Dignify Solutions, LLC","location":"Jersey City, NJ","posted_date_attr":"2025-04-11","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/front-end-software-developer-remote-at-the-dignify-solutions-llc-4224062777?position=3&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=udWp8uT5rDTRej1NKECcJg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4224062777?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"A tenured and up to date proficiency in JavaScript, preferably with the ReactJS framework. Strong understanding of testing (unit, integration, e2e) and type checking tools including Jest/RTL/TypescriptFamiliarity with various styling methodologies including CSS and CSS in JS librariesAbility to communicate effectively with non-technical stakeholdersUnderstanding of automated testing using Cypress/Cucumber/GherkinUnderstanding of micro frontend and microservices architectureUnderstanding of modern build tools such as Vite, micro bundler, parcel","applicants_count":"29","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Other","Industries":"IT Services and IT Consulting"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Other","industries":"IT Services and IT Consulting"},{"job_id":"4224061876","title":"Front-End Software Developer - Remote","company":"The Dignify Solutions, LLC","location":"Jersey City, NJ","posted_date_attr":"2025-04-11","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/front-end-software-developer-remote-at-the-dignify-solutions-llc-4224061876?position=4&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=JYkQXLydDi90XM0LbeRicg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4224061876?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"A tenured and up to date proficiency in JavaScript, preferably with the ReactJS framework. Strong understanding of testing (unit, integration, e2e) and type checking tools including Jest/RTL/TypescriptFamiliarity with various styling methodologies including CSS and CSS in JS librariesAbility to communicate effectively with non-technical stakeholdersUnderstanding of automated testing using Cypress/Cucumber/GherkinUnderstanding of micro frontend and microservices architectureUnderstanding of modern build tools such as Vite, micro bundler, parcel","applicants_count":"31","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Other","Industries":"IT Services and IT Consulting"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Other","industries":"IT Services and IT Consulting"},{"job_id":"4223902295","title":"Senior Full Stack Developer","company":"Genpact","location":"United States","posted_date_attr":"2025-05-05","posted_text":"2 weeks ago","link":"https://www.linkedin.com/jobs/view/senior-full-stack-developer-at-genpact-4223902295?position=5&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=R9P9b1iakD3w6MsJfuxk3g%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4223902295?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"Ready to build the future with AI? At Genpact, we don’t just keep up with technology—we set the pace. AI and digital innovation are redefining industries, and we’re leading the charge. Genpact’s AI Gigafactory, our industry-first accelerator, is an example of how we’re scaling advanced technology solutions to help global enterprises work smarter, grow faster, and transform at scale. From large-scale models to agentic AI, our breakthrough solutions tackle companies’ most complex challenges. If you thrive in a fast-moving, innovation-driven environment, love building and deploying cutting-edge AI solutions, and want to push the boundaries of what’s possible, this is your moment. Genpact (NYSE: G) is an advanced technology services and solutions company that delivers lasting value for leading enterprises globally. Through our deep business knowledge, operational excellence, and cutting-edge solutions – we help companies across industries get ahead and stay ahead. Powered by curiosity, courage, and innovation, our teams implement data, technology, and AI to create tomorrow, today. Get to know us at genpact.com and on LinkedIn, X, YouTube, and Facebook. Job Description:Inviting applications for the role of Senior Full Stack DeveloperIn this role, you will engage in and drive development for the analytics, surveillance and data portion of the riskCanvas End-to-End Anti-Money Laundering Tool Suite. This person will work to grow the business through creating groundbreaking technical solutions in order to maintain and grow our client base. Use of technical solutions to transform and analyze large data sets is crucial to this role. Also necessary is expertise in big data, data storage and retrieval, methods of analysis and statistical calculation, optimization and algorithm design and implementation. As a technical leadership role, comfort in quickly designing and explaining solutions to clients is key. Working both directly and indirectly for clients, one would need excellent consulting and technical skills and the ability to work with both high level business leaders and technical staff.Responsibilities:Seasoned developer for L3 support and maintenance of the riskCanvas product.Debugging and developing new code in Java and Python.Flexible work hours including weekends and holidays.Willing to work on weekends and after hours on rotation shift.Designing, implementing, and enhancing distributed parallel data analytics software for AMLConfiguring and maintaining Hadoop-based platforms for Big Data parallel processesUsing advanced techniques (indexing, caching, estimating, etc.) to improve code efficiencyGathering and sequencing business and technical requirementsTroubleshooting and resolving complex data and processing issuesIntegrating designed data analytics into a larger software ecosystemLearning new methods, frameworks and languages to ensure optimal solutionsUnderstanding and communicating complex technical solutions in theAML/KYC/EDD domain and evangelizing the riskCanvas solution to clientsQualifications we seek in you!Minimum QualificationsBachelor’s Degree or equivalent in Engineering, Computer Science, ITMinimum of five years of experience in the IT industryPreferred Qualifications/ SkillsExperience with Big Data & Data AnalyticsExperience with Angular frameworkExperience using distributed and parallel computing technologies, including Hadoop, MapReduce, and Spark, to write batch and streaming analytic processing jobsExperience demonstrating NoSQL database systems, including HBase or a similar data storeExperience in XML, JSONExperience with machine learning algorithms, statistics, operations research or data analysisExperience implementing and demonstrating Elasticsearch or a similar indexerAbility to learn quickly and work independentlyExemplary technical communications skillsExperience with gitExperience working in an agile environmentExperience working with other big data technologies (Kafka, Neo4J, Flink, Ignite, etc.)Experience with Linux operating systemsExperience with implementing rapid response query solutions on Big Data platforms, including indexing for combinations and variations of temporal, spatial, and textualExperience with relational databases, including SQLExperience with exposing query and analytic capabilities as RESTful servicesExperience with Scala, RExperience teaching and leading technical conversationsFamiliarity with visualization and user interface technologiesWhy join Genpact? Lead AI-first transformation – Build and scale AI solutions that redefine industries Make an impact – Drive change for global enterprises and solve business challenges that matter Accelerate your career—Gain hands-on experience, world-class training, mentorship, and AI certifications to advance your skills Grow with the best – Learn from top engineers, data scientists, and AI experts in a dynamic, fast-moving workplace Committed to ethical AI – Work in an environment where governance, transparency, and security are at the core of everything we build Thrive in a values-driven culture – Our courage, curiosity, and incisiveness - built on a foundation of integrity and inclusion - allow your ideas to fuel progress Come join the 140,000+ coders, tech shapers, and growth makers at Genpact and take your career in the only direction that matters: Up. Let’s build tomorrow together\"The approximate annual base compensation range for this position is $120,000 to $130,000. The actual offer, reflecting the total compensation package plus benefits will be determined by a number of factors which include but are not limited to the applicant's experience, knowledge, skills, and abilities; geographic location; and internal equity.\"Work-from-Anywhere Roles – “Los Angeles California-based candidates are not eligible for this role”Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values respect and integrity, customer focus, and innovation.Furthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such scams include purchasing a 'starter kit,' paying to apply, or purchasing equipment or training.","applicants_count":"64","salary_range":"$120,000.00/yr","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Analyst, Consulting, and Information Technology","Industries":"Business Consulting and Services and Financial Services"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Analyst, Consulting, and Information Technology","industries":"Business Consulting and Services and Financial Services"},{"job_id":"4216740669","title":"Javascript Developer","company":"Insight Global","location":"United States","posted_date_attr":"2025-04-24","posted_text":"3 weeks ago","link":"https://www.linkedin.com/jobs/view/javascript-developer-at-insight-global-4216740669?position=6&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=EispM0Iv9LeIpV%2FPPM6jhA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4216740669?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"Location: Remote, PST hours preferredPay Rate: $50-65/hrDuration: 5mo contract, about 20-30 hours/week Start Date: May 12th Must Haves:4+ years of experience using Javascript/Typescript for new feature creation and application maintenanceProven experience in building server-side applications using Node.jsExperience with AWS services such as Lambda, S3, and DynamoDB.Experience with testing frameworks and tools (e.g., Mocha, Chai, Jest)Experience with various APIs (RESTful, SOAP)Preferred:Experience within higher education industryResponsibilities:Develop and maintain web applications for ongoing projectsDeploy and manage applications on AWS, ensuring high availability and scalability.Collaborate with cross-functional teams to define and design new featuresConduct code reviews and provide constructive feedback to team members.Troubleshoot and debug applications to optimize performance.Compensation: $50/hr to $65/hr. Exact compensation may vary based on several factors, including skills, experience, and education. Employees in this role will enjoy a comprehensive benefits package starting on day one of employment, including options for medical, dental, and vision insurance. Eligibility to enroll in the 401(k) retirement plan begins after 90 days of employment. Additionally, employees in this role will have access to paid sick leave and other paid time off benefits as required under the applicable law of the worksite location.","applicants_count":"未找到","salary_range":"$50.00/hr","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Contract","Job function":"Engineering","Industries":"Higher Education"},"seniority":"Mid-Senior level","employment_type":"Contract","job_function":"Engineering","industries":"Higher Education"},{"job_id":"4182767105","title":"Staff Software Engineer, Location","company":"Airbnb","location":"San Francisco, CA","posted_date_attr":"2025-05-15","posted_text":"5 days ago","link":"https://www.linkedin.com/jobs/view/staff-software-engineer-location-at-airbnb-4182767105?position=7&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=qr512JlxmfEgrL%2F5u9upzw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4182767105?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinThe Location team at Airbnb is responsible for building a world class search experience for our guests. The team works on one of the most used features at Airbnb, the map search experience and aims to provide our guests the necessary location context for them to easily and efficiently find the right listings to book. The team also owns a family of products in the location space, such as point of interests, the places page, and guidebook.The team is cross-discipline with expertise in iOS, Android, web and backend development and works closely with other search teams, platform teams, and partners in design, product, and data science to deliver new search experiences for Airbnb’s guests. A Typical DayBuild the next-gen map search experience used by millions of guests.Collaborate with cross-functional partners such as Product Managers, Experience Designers and other Engineers to design, prototype, and deliver high-quality guest-facing products on Desktop and Moweb.Identify areas of improvement and drive web best practices, as well as maintain a high quality bar in our codebase.Your Expertise9+ years of experience in a hands-on software engineering role in backend development. Bachelor’s and/or Master/PhD’s degree, preferably in CS, or equivalent experience Extensive experience working in Java and/or KotlinPassionate about efficiency, availability, technical quality and system qualityPassionate about design and UX sensibilitiesExperience working with GraphQL and REST APIsExcellent communication and collaboration skills and the ability to work well within engineering organization and cross functionsLove collaborating via code reviews, architecture discussions, and are motivated to improve their teammates’ productivityExperience working with a microservice architecture at scale[Bonus] Experience working on a Product team or customer-centric software supporting a medium to large engineering organization[Bonus] Show motivation for personal growth and learning new technologies to support the team’s need[Bonus] Prior experience and/or interest in fullstack/front-end technologiesYour Location:This position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list . If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.We strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process.We ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.How We'll Take Care Of YouOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.Pay Range$204,000—$255,000 USD","applicants_count":"139","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Research and Engineering","Industries":"Software Development"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Research and Engineering","industries":"Software Development"},{"job_id":"4189701979","title":"Software Engineer I","company":"Affirm","location":"Portland, OR","posted_date_attr":"2025-05-08","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-i-at-affirm-4189701979?position=8&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=auZJLYbItLIog4O30vTjcQ%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4189701979?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.The Merchant Data Platform is a backend, foundational service at Affirm. We are responsible for merchant data and identity across all merchant touchpoints. Our checkout-critical platform serves millions of requests per day, supports the onboarding of merchants across all onboarding touchpoints and maintains strict availability and latency SLAs given the criticality of the service. Further, the team maintains sophisticated pipelines that enrich our datasets for the purposes of merchant identification, risk analysis and fraud detection.What You'll Do With the support of your team, you will work on tasks that contribute to the team's projects and goals. You will work collaboratively and proactively with your team and stakeholders, bringing them along for your work and helping to create visibility and dialog regarding the risks and trade-offs related to your work. You will strike the right balance of speed and quality in your work, ensuring that we hit our business goals while protecting our systems from downtime. You will contribute to a sense of community on your team by engaging in growth and development activities.What We Look For You have previous work or internship experience designing, developing and launching backend systems at scale and are experienced using one of Python or Kotlin. You are familiar with the building blocks of distributed systems, and the technologies like AWS, MySQL and Kubernetes. You have mastered taking a simple problem or business scenario into a solution that interacts with multiple software components, and executing on it by writing clear, easily understood, well tested and extensible code. You are comfortable navigating a large code base, debugging others' code, and providing feedback to other engineers through code reviews. Your experience demonstrates that you take ownership of your growth, proactively seeking feedback from your team, your manager, and your stakeholders. You have strong verbal and written communication skills that support effective collaboration with our global engineering team. This position requires either equivalent practical experience or a Bachelor’s degree in a related field.Pay Grade - JEquity Grade - 5Employees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.Base pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)USA base pay range (CA, WA, NY, NJ, CT) per year: $130,000 - $170,000USA base pay range (all other U.S. states) per year: $115,000 - $155,000Additional Benefits Include Flexible Spending Wallets for tech, food and lifestyle Away Days - wellness days to take off work and recharge Learning & Development programs Parental leave Employee Resource & Community GroupsAffirm is proud to be a remote-first company! The majority of our roles are remote and you can work almost anywhere within the country of employment. Affirmers in proximal roles have the flexibility to work remotely, but will occasionally be required to work out of their assigned Affirm office. A limited number of roles remain office-based due to the nature of their job responsibilities.BenefitsWe’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:Health care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expensesTime off - competitive vacation and holiday schedules allowing you to take time off to rest and rechargeESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discountWe believe It’s On Us to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.[For U.S. positions that could be performed in Los Angeles or San Francisco] Pursuant to the San Francisco Fair Chance Ordinance and Los Angeles Fair Chance Initiative for Hiring Ordinance, Affirm will consider for employment qualified applicants with arrest and conviction records.By clicking \"Submit Application,\" you acknowledge that you have read Affirm's Global Candidate Privacy Notice and hereby freely and unambiguously give informed consent to the collection, processing, use, and storage of your personal information as described therein.","applicants_count":"50","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Financial Services"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services"},{"job_id":"4058656887","title":"Software Engineer - Extensibility","company":"Figma","location":"New York, NY","posted_date_attr":"2025-05-10","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-extensibility-at-figma-4058656887?position=9&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=H3KCJwhHVVqcF6PJzSm8tg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4058656887?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"Figma is growing our team of passionate people on a mission to make design accessible to all. Born on the Web, Figma helps entire product teams brainstorm, design and build better products — from start to finish. Whether it’s consolidating tools, simplifying workflows, or collaborating across teams and time zones, Figma makes the design process faster, more efficient, and fun while keeping everyone on the same page. From great products to long-lasting companies, we believe that nothing great is made alone—come make with us!The Extensibility team owns Figma’s developer platform: plugins, widgets, REST API, and webhooks. Entire companies have been built around Figma plugins. Tens of thousands of designers at large Figma customers use private plugins to work faster. Developers use our APIs to power workflows that synchronize design system variables from GitHub into Figma variables, and update project management tasks when designs are marked ready for development.Our team touches broad parts of the Figma product: maintaining a JavaScript sandbox, creating new kinds of plugins for Dev Mode, optimizing JSON encoding in C++, operating large-scale live services written in Node and Go, updating our multiplayer service to accept server-side writes, and writing a React-style “diffing” algorithm for widgets. We also do a moderate amount of fullstack development with a React frontend and a Sinatra backend.This is a full time role that can be held from one of our US hubs or remotely in the United States.What you'll do at Figma:Write Typescript, Ruby, and C++ code implementing new features, fixing bugs, and performance issues.Work with Figma product teams to help their features get exposed programmatically via our plugin and REST API.Work closely with product managers and product designers to design simple experiences for complex UX problems.Meet with members of our developer community to understand their successes and pain points.We’d love to hear from you if you have:Industry experience working on a developer platform or developer tooling.5+ years of experience with React or similar front-end Typescript frameworks.Experience with distributed systems and/or running a high volume public API.Experience with ORMs, reading and writing SQL, and debugging query plans.While it’s not required, it’s an added plus if you also have:Experience embedding a virtual machine in another programming language.Experience with WebAssembly.C++ or C experience.Extensive experience building developer platforms or open source communities.A strong design sense and proven track record working closely with product designers.Pay Transparency DisclosureIf based in Figma’s San Francisco or New York hub offices, this role has the annual base salary range stated below.Job level and actual compensation will be decided based on factors including, but not limited to, individual qualifications objectively assessed during the interview process (including skills and prior relevant experience, potential impact, and scope of role), market demands, and specific work location. The listed range is a guideline, and the range for this role may be modified. For roles that are available to be filled remotely, the pay range is localized according to employee work location by a factor of between 80% and 100% of range. Please discuss your specific work location with your recruiter for more information.Figma offers equity to employees, as well a competitive package of additional benefits, including health, dental & vision, retirement with company contribution, parental leave & reproductive or family planning support, mental health & wellness benefits, generous PTO, company recharge days, a learning & development stipend, a work from home stipend, and cell phone reimbursement. Figma also offers sales incentive pay for most sales roles and an annual bonus plan for eligible non-sales roles. Figma’s compensation and benefits are subject to change and may be modified in the future.Annual Base Salary Range (SF/NY Hub):$149,000—$350,000 USDAt Figma we celebrate and support our differences. We know employing a team rich in diverse thoughts, experiences, and opinions allows our employees, our product and our community to flourish. Figma is an equal opportunity workplace - we are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity/expression, veteran status, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.We will work to ensure individuals with disabilities are provided reasonable accommodation to apply for a role, participate in the interview process, perform essential job functions, and receive other benefits and privileges of employment. If you require accommodation, please reach out to accommodations-ext@figma.com. These modifications enable an individual with a disability to have an equal opportunity not only to get a job, but successfully perform their job tasks to the same extent as people without disabilities.Examples of accommodations include but are not limited to:Holding interviews in an accessible locationEnabling closed captioning on video conferencingEnsuring all written communication be compatible with screen readersChanging the mode or format of interviews To ensure the integrity of our hiring process and facilitate a more personal connection, we require all candidates keep their cameras on during video interviews. Additionally, if hired you will be required to attend in person onboarding.By applying for this job, the candidate acknowledges and agrees that any personal data contained in their application or supporting materials will be processed in accordance with Figma's Candidate Privacy Notice.","applicants_count":"174","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Design Services"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Design Services"},{"job_id":"4225530597","title":"Senior Software Engineer, Full-Stack","company":"Ord.io","location":"New York, NY","posted_date_attr":"2025-04-12","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/senior-software-engineer-full-stack-at-ord-io-4225530597?position=10&pageNum=42&refId=nhyVuADIxWBC1omOyyivcQ%3D%3D&trackingId=eB6oy1ul0N3lMTItfb8qWw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4225530597?refId=nhyVuADIxWBC1omOyyivcQ%3D%3D","ref_id":"nhyVuADIxWBC1omOyyivcQ==","job_description":"Ord.io is building the all-in-one platform for Web3 on Bitcoin. Our product offers a seamless, unified experience for exploring and trading Bitcoin memecoins and NFTs, tracking portfolios, and socializing in token-gated group chats. By prioritizing user safety and ease of use, we have gained significant traction and raised a $2M pre-seed round in April 2024. We are a fully remote team.ResponsibilitiesOwn user-facing features on our platformLead initiatives to launch new products and infrastructureMaintain and improve existing systemsStrengthen and evolve our culture of engineering excellenceInterface directly with users and help shape the product directionRequirementsBachelor's degree in Computer Science or a related field, or equivalent practical experience5+ years full-time software engineering experienceProficient with Next.js, Node.js, MySQL, Redis, React, TypeScript, RESTful APIs, AWS, CI/CDStrong experience building and owning high-availability, scalable, secure, low-latency systemsSelf-starter who proactively takes initiative without waiting for direction and can jump in and start providing value on day oneNice to Have: Experience with Bitcoin and cryptoBenefitsCompetitive salary ($180,000 to $240,000)EquityMedical/dental/vision/life insurance (100% covered)Stipend for your remote set-upFlexible hours (fully remote culture)Unlimited vacation","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering","Industries":"IT Services and IT Consulting"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering","industries":"IT Services and IT Consulting"},{"job_id":"4231168708","title":"Software Engineer","company":"Media Riders Inc.","location":"United States","posted_date_attr":null,"posted_text":"未知日期","link":"https://www.linkedin.com/jobs/view/software-engineer-at-media-riders-inc-4231168708?position=1&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=dh77aDZFQxvYXE013uWG9A%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4231168708?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"We are seeking an accomplished Software Developer to work on our premier insurance administration and proposal systems. The successful candidate enjoys working in a fast-paced and dynamic environment as a key part of a highly skilled and committed team.  Essential Duties & Responsibilities: • Work effectively and collaboratively in an agile environment • Actively participate in the review of business requirements • Analyze business/technical problems • Develop estimates for assigned work • Communicate well and work in partnership with our business partners and IT resources • Code highly effective and highly usable solutions, completing tasks accurately and in agreed upon timelines • Follow systems standards, procedures and delivery methodology and provide input for continuous improvement • Support production problem resolution • Understand the business processes support by our applications • Continually develop technical and business knowledge & skills • Work professionally and effectively with co-workers, clients, vendors and others with whom FullscopeRMS does business • Document systems and processes as needed • Remote, onsite, hybrid work locations as required  Critical Skills: Minimum 4+ years previous Microsoft Access/VBA, SQL Server. Preferred experience in SQL Server Integration/Reporting Services (SSIS & SSRS). • Strong knowledge of software delivery, processes and tools leveraged in a mature IT environment • Successful agile/scrum experience • Solid knowledge of unit testing and overall delivery process • Creativity, critical, analytical thinking and well-developed problem-solving skills • Adaptable and committed to excellence","applicants_count":"未找到","salary_range":"$60.00/hr","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Design","Industries":"Software Development, IT System Custom Software Development, and IT System Design Services"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Design","industries":"Software Development, IT System Custom Software Development, and IT System Design Services"},{"job_id":"4217739976","title":"Full Stack Developer","company":"DataAnnotation","location":"Alpharetta, GA","posted_date_attr":"2025-05-19","posted_text":"1 day ago","link":"https://www.linkedin.com/jobs/view/full-stack-developer-at-dataannotation-4217739976?position=2&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=Wobqe1J%2BaZqGKGbQ10xstw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4217739976?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.We are looking for a proficient Full Stack Developer to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.To apply to this role, you will need to be proficient in either Python and/or JavaScript. Your role will require proficiency in at least one programming language/framework (JavaScript, TypeScript, Python, C, C#, C++, HTML/CSS, React, Go, Java, Kotlin, SQL, or Swift) in order to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.Benefits:This is a full-time or part-time REMOTE positionYou’ll be able to choose which projects you want to work onYou can work on your own scheduleProjects are paid hourly, starting at $40+ USD per hour, with bonuses for high-quality and high-volume workResponsibilities:Come up with diverse problems and solutions for a coding chatbotWrite high-quality answers and code snippetsEvaluate code quality produced by AI models for correctness and performanceQualifications:Fluency in English (native or bilingual level)Proficient in either Python and/or JavaScriptExcellent writing and grammar skillsA bachelor's degree (completed or in progress)Previous experience as a Software Developer, Coder, Software Engineer, or ProgrammerNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, UK, Canada, Australia, or New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.","applicants_count":"60","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Not Applicable","Employment type":"Contract","Job function":"Engineering, Research, and Analyst","Industries":"Software Development, Computer and Network Security, and Engineering Services"},"seniority":"Not Applicable","employment_type":"Contract","job_function":"Engineering, Research, and Analyst","industries":"Software Development, Computer and Network Security, and Engineering Services"},{"job_id":"3957994590","title":"Fullstack Software Engineer","company":"Novellia","location":"United States","posted_date_attr":"2024-06-24","posted_text":"11 months ago","link":"https://www.linkedin.com/jobs/view/fullstack-software-engineer-at-novellia-3957994590?position=3&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=Xmi4sdbQKhSLYH9WpQCxKw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/3957994590?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"Novellia is the first and only company that lets anyone in the US gain access to nearly a decade of their health data in under 30 seconds, 100% free. All your health records, across doctors, all in one place, always up to date.We work with the world's top researchers to safely turn health insights into life-changing action for millions of people across the world.We are seeking talented and experienced Fullstack Software Engineers to join our dynamic team. The ideal candidate will have expertise in Next.js, Node.js, PostgreSQL, and Google Cloud, with a bonus if they have experience in digital health technologies. As a crucial member of our engineering team, you will play a key role in developing and enhancing our products to deliver exceptional user experiences.The role can be for a principal, lead, staff or senior title depending on experience and career preference of the candidate.Responsibilities:Collaborate within cross-functional teams to design, develop, and deploy scalable and efficient software solutions. Take ownership of end-to-end feature development, from conception to deployment and maintenance. Contribute innovative ideas and solutions to improve product functionality, performance, and usability. Implement best practices for coding, testing, and deployment to ensure high-quality deliverables. Work closely with product managers and designers to translate requirements into technical specifications. Stay updated on industry trends and emerging technologies to drive continuous improvement and innovation. Requirements:Bachelor's degree in Computer Science, Engineering, or equivalent. Minimum of 5 years of experience in software development, with at least 2 years in a startup environment. Proficiency in Next.js, Node.js, PostgreSQL, and Google Cloud Platform or similar technologies. A history of delivery on high impact organizational projects. Experience in digital health technologies is a strong plus. Strong problem-solving skills and ability to think creatively to overcome technical challenges. Excellent communication and collaboration skills, with a proactive and positive attitude. Passion for product development and a willingness to take initiative and ownership of projects. Commitment to following best practices and standards for software development. Wants to be part of building an engineering team from the ground up. Participation in on-call rotation. Benefits and perks:Equity in NovelliaMedical, dental, and vision coverage401kFlexible Time offWellness stipendUp to 12 weeks of parental leaveDon’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At Novellia, we are dedicated to building a diverse, inclusive and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.U.S. Applicants OnlyCompensation Range: $150K - $200K","applicants_count":"未找到","salary_range":"$150,000.00/yr","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Software Development"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development"},{"job_id":"4189701975","title":"Software Engineer I","company":"Affirm","location":"Richmond, VA","posted_date_attr":"2025-05-13","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-i-at-affirm-4189701975?position=4&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=oY7883Cl633JQj%2FlfdfeTA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4189701975?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.The Merchant Data Platform is a backend, foundational service at Affirm. We are responsible for merchant data and identity across all merchant touchpoints. Our checkout-critical platform serves millions of requests per day, supports the onboarding of merchants across all onboarding touchpoints and maintains strict availability and latency SLAs given the criticality of the service. Further, the team maintains sophisticated pipelines that enrich our datasets for the purposes of merchant identification, risk analysis and fraud detection.What You'll Do With the support of your team, you will work on tasks that contribute to the team's projects and goals. You will work collaboratively and proactively with your team and stakeholders, bringing them along for your work and helping to create visibility and dialog regarding the risks and trade-offs related to your work. You will strike the right balance of speed and quality in your work, ensuring that we hit our business goals while protecting our systems from downtime. You will contribute to a sense of community on your team by engaging in growth and development activities.What We Look For You have previous work or internship experience designing, developing and launching backend systems at scale and are experienced using one of Python or Kotlin. You are familiar with the building blocks of distributed systems, and the technologies like AWS, MySQL and Kubernetes. You have mastered taking a simple problem or business scenario into a solution that interacts with multiple software components, and executing on it by writing clear, easily understood, well tested and extensible code. You are comfortable navigating a large code base, debugging others' code, and providing feedback to other engineers through code reviews. Your experience demonstrates that you take ownership of your growth, proactively seeking feedback from your team, your manager, and your stakeholders. You have strong verbal and written communication skills that support effective collaboration with our global engineering team. This position requires either equivalent practical experience or a Bachelor’s degree in a related field.Pay Grade - JEquity Grade - 5Employees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.Base pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)USA base pay range (CA, WA, NY, NJ, CT) per year: $130,000 - $170,000USA base pay range (all other U.S. states) per year: $115,000 - $155,000Additional Benefits Include Flexible Spending Wallets for tech, food and lifestyle Away Days - wellness days to take off work and recharge Learning & Development programs Parental leave Employee Resource & Community GroupsAffirm is proud to be a remote-first company! The majority of our roles are remote and you can work almost anywhere within the country of employment. Affirmers in proximal roles have the flexibility to work remotely, but will occasionally be required to work out of their assigned Affirm office. A limited number of roles remain office-based due to the nature of their job responsibilities.BenefitsWe’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:Health care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expensesTime off - competitive vacation and holiday schedules allowing you to take time off to rest and rechargeESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discountWe believe It’s On Us to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.[For U.S. positions that could be performed in Los Angeles or San Francisco] Pursuant to the San Francisco Fair Chance Ordinance and Los Angeles Fair Chance Initiative for Hiring Ordinance, Affirm will consider for employment qualified applicants with arrest and conviction records.By clicking \"Submit Application,\" you acknowledge that you have read Affirm's Global Candidate Privacy Notice and hereby freely and unambiguously give informed consent to the collection, processing, use, and storage of your personal information as described therein.","applicants_count":"34","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Financial Services"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services"},{"job_id":"4218893568","title":"Full Stack Developer","company":"UST","location":"United States","posted_date_attr":"2025-04-30","posted_text":"2 weeks ago","link":"https://www.linkedin.com/jobs/view/full-stack-developer-at-ust-4218893568?position=5&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=OBI21OewEdpa%2FKYdD1USrA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4218893568?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"Role DescriptionFull Stack DeveloperLead I - Software EngineeringWho We AreBorn digital, UST transforms lives through the power of technology. We walk alongside our clients and partners, embedding innovation and agility into everything they do. We help them create transformative experiences and human-centered solutions for a better world.UST is a mission-driven group of 29,000+ practical problem solvers and creative thinkers in more than 30 countries. Our entrepreneurial teams are empowered to innovate, act nimbly, and create a lasting and sustainable impact for our clients, their customers, and the communities in which we live.With us, you’ll create a boundless impact that transforms your career—and the lives of people across the world.Visit us at UST.com.You AreUST is looking for a Full Stack Developer with following skillset and experience: Project/Team Background: The Full Stack Developer will join an agile development team focused on cutting-edge internal actuarial solutions.The Opportunity Create API-based web applications from concept to production, emphasizing cloud-first architecture Tackle complex technical challenges, providing innovative solutions in ambiguous situations Work closely with product stakeholders and development team, effectively communicating technical concepts Design, develop, test, and deploy API-based systems using industry-leading practices Ensure high-quality, well-tested code and seek continuous improvements Mentor team members and make critical technical decisionsThis position description identifies the responsibilities and tasks typically associated with the performance of the position. Other relevant essential functions may be required.What You Need 8+ years of software development experience Proficiency in multiple tools of the full stack covering frontend frameworks, databases, and deployments Experience with a variety of general programming languages Experience with Test-Driven Development Experience with a variety of database technologies Demonstrated ability to quickly learn new technologies Advanced ability to solve complex problems, drawing upon creativity, experience, and multiple sources of information Advanced communication skills, including the ability to communicate complex information in straightforward manner Technical Requirements: Must-Have AWS (Amazon Web Services, Serverless, Containerization) Node.js React Relational/NoSQL database (Oracle, Postgres) Terraform (Dev Ops, Jenkins, CI/CD) SQL (Solid understanding of writing SQL) C# (Code comprehension) Nice to have: Power BI Snowflake Python Shell Scripting Groovy Soft skills: Fluency in English, both written and verbal Brings and cultivates Innovative ideas across the team Preferred: Insurance and/or reinsurance industry knowledge Advanced knowledge of the Software Development Life Cycle Professional CertificationsCompensation can differ depending on factors including but not limited to the specific office location, role, skill set, education, and level of experience. UST provides a reasonable range of compensation for roles that may be hired in various U.S. markets as set forth below.Role Location: Remote-CanadaCompensation Range: $89,000-$109,000BenefitsFull-time, regular employees accrue a minimum of 10 days of paid vacation per year, receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year), paid holidays, and are eligible for paid bereavement leave and jury duty. They and their dependents residing in Canada are eligible for Supplemental Healthcare coverage, as well as Company-paid Employee Only basic life insurance and accidental death and dismemberment coverage.Full-time temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year). They and their dependents residing in Canada are eligible for Supplemental Healthcare coverage, as well as Company-paid Employee Only basic life insurance and accidental death and dismemberment coverage.Part-time regular and temporary employees receive 6 days of paid sick leave each year (pro-rated for new hires throughout the year).All Canadian employees who work in a province, territory or locality with more generous paid sick leave benefits than specified here will receive the benefit of those sick leave laws.What We BelieveWe proudly embrace the values that have shaped UST since day one. We build our culture of Humility, Humanity, and Integrity. These values inspire us to nurture a people-first, human centric culture that fosters diversity, prioritizes sustainable solutions, and keeps our people and clients at the forefront of all decisions.HumilityWe will listen, learn, be empathetic and help selflessly in our interactions with everyone.HumanityThrough business, we will better the lives of those less fortunate than ourselves.IntegrityWe honor our commitments and act with responsibility in all our relationships.An Equal Opportunity Workplace, Free of Discrimination and HarassmentAt UST, we strive to provide a work environment free of discrimination and harassment. We are an equal opportunity employer and employment decisions are based on merit and business needs. Our Human Rights Policy further illustrates our stand on this. We are committed to following fair employment practices that provide equal opportunities to all employees. We do not discriminate or allow harassment on the basis of race, color, religion, disability, gender, national origin, sexual orientation, gender identity, gender expression, age, genetic information, military status, or any other legally protected status. At UST, we value diversity and believe that a diverse workplace builds a competitive advantage.Un lieu de travail à égalité des chances, sans Discrimination et harcèlementChez UST, nous nous efforçons de fournir un environnement de travail exempt de discrimination et harcèlement. Nous sommes un employeur garantissant l'égalité des chances et des décisions en matière d'emploi sont basés sur le mérite et les besoins de l'entreprise. Notre politique en matière de droits de l'homme illustre notre position à ce sujet. Nous nous engageons à respecter un emploi équitable des pratiques qui offrent des chances égales à tous les employés. Nous ne faisons pas discriminer ou permettre le harcèlement sur la base de la race, de la couleur, de la religion, du handicap, genre, origine nationale, orientation sexuelle, identité de genre, expression de genre, âge, informations génétiques, statut militaire ou tout autre statut légalement protégé. Chez UST, nous valorisons la diversité et pensons qu'un lieu de travail diversifié crée un avantage compétitif.UST reserves the right to periodically redefine your roles and responsibilities based on the requirements of the organization and/or your performance.#USTSkillsNode.Js,Terraform,React","applicants_count":"31","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"IT Services and IT Consulting"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"IT Services and IT Consulting"},{"job_id":"4184785488","title":"Senior Software Engineer (L5) — Build & Dependency Management Team (JVM Ecosystem)","company":"Netflix","location":"United States","posted_date_attr":null,"posted_text":"未知日期","link":"https://www.linkedin.com/jobs/view/senior-software-engineer-l5-%E2%80%94-build-dependency-management-team-jvm-ecosystem-at-netflix-4184785488?position=6&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=VHFF1jD%2FBvBNezTY%2BaS0Yw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4184785488?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.About The TeamThe Build & Dependency Management team is a vital part of Netflix's Productivity Engineering organization, and supports Java & JVM-based applications and services that power the Netflix service graph. This team focuses on enhancing the efficiency and reliability of our build processes, dependency management, and testing infrastructure, primarily using Nebula and Gradle. By optimizing these processes, we empower Netflix engineers to deliver high-quality software at scale.About The RoleWe are seeking an experienced Software Engineer to join our Build & Dependency Management team. The ideal candidate will have a strong background in build systems, dependency management, and testing tools, with a particular focus on Nebula and Gradle. This role involves developing and maintaining tools and infrastructure that streamline build processes, ensure robust dependency management, and enhance testing capabilities. A large part of the team’s role is ensuring that we deliver high-quality tools to enable and enhance developer experiences in creating software, which includes consulting with related teams and individual users of our systems.Key ResponsibilitiesCommon Languages and Tools: Java & other JVM languages, Gradle, Nebula, Spring Boot, JUnit, GraphQL, Kafka, PostgreSQL.Implement and manage build solutions that enhance the efficiency and reliability of software delivery.Develop and maintain backwards-compatible tools for dependency management and analysis.Integrate internal and vendor-provided build and test infrastructure into engineering workflows, focusing on reliability and ease of use.Design and develop tools and infrastructure to automatically detect, quarantine, and reproduce flaky tests.Create and maintain tools for analysis of distributed tracing tools for test runs.Develop and integrate software solutions that provide high-quality synthetic test data generated from captured production traffic and API schema registries.Correlate test coverage data with code changes, runtime execution, and trace data for comprehensive reporting.Maintain a strong focus on scalability, usability, and reliability in platform design to support a growing cohort of engineers.Be willing and able to showcase our team’s offerings to internal audiencesConsult with other teams about how to best collaborate, integrate, and/or set up solutions for their needsStay informed about industry trends and emerging technologies to ensure Netflix remains at the forefront of build, dependency management, and testing infrastructure.Who You AreA skilled software engineer with experience in developer platform or productivity teams.A meticulous software designer who researches and documents technical tradeoffs clearly and concisely.A self-motivated and organized individual who can independently drive engineering-wide solutions.A proactive communicator who engages effectively with technical and non-technical stakeholders.An advocate for strong build, dependency management, and testing practices, with familiarity in popular build tools, test frameworks, code coverage tools, continuous integration systems, and post-deployment verification methods (a healthy contempt for flaky tests is a plus).You have shipped and maintained Java code in production.Experience We’d Be Excited AboutYou have worked on various technology stacks and are familiar with a variety of ways that software could be designed for different optimizations.You have designed and implemented build and dependency management solutions.You have built (and tested) custom Gradle plugins.You have assembled JVM Spring Boot applications using Gradle.You have experience with Nebula, Gradle, Maven, etc, for dependency management.You have experience with using and explaining Develocity dashboards.You are comfortable working with Zipkin or similar tools in the tracing space.You have implemented advanced log, metric, or error stacktrace analysis.What We ProvideOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.Job is open for no less than 7 days and will be removed when the position is filled.","applicants_count":"未找到","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Not Applicable","Employment type":"Full-time","Job function":"Other","Industries":"Entertainment Providers"},"seniority":"Not Applicable","employment_type":"Full-time","job_function":"Other","industries":"Entertainment Providers"},{"job_id":"4233863325","title":"Senior Software Engineer, Backend","company":"TCGplayer (an eBay company)","location":"United States","posted_date_attr":null,"posted_text":"未知日期","link":"https://www.linkedin.com/jobs/view/senior-software-engineer-backend-at-tcgplayer-an-ebay-company-4233863325?position=7&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=3zPwU%2B9vgJfNTkLLNVU69g%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4233863325?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"At eBay, we're more than a global ecommerce leader — we’re changing the way the world shops and sells. Our platform empowers millions of buyers and sellers in more than 190 markets around the world. We’re committed to pushing boundaries and leaving our mark as we reinvent the future of ecommerce for enthusiasts.Our customers are our compass, authenticity thrives, bold ideas are welcome, and everyone can bring their unique selves to work — every day. We're in this together, sustaining the future of our customers, our company, and our planet.Join a team of passionate thinkers, innovators, and dreamers — and help us connect people and build communities to create economic opportunity for all.About The Team And The RoleAn eBay company, TCGplayer is on a quest to be the most trusted trading card game (TCG) platform — connecting and empowering the hobby community. Founded by and for TCG enthusiasts, we operate a global marketplace, and create tools, technologies and solutions that help small businesses simply and profitably sell TCGs at scale.As a Senior Software Engineer, you will be a key contributor to large, mission critical, technical projects that span multiple development teams. Your team will be primarily responsible for enhancing the order management and fulfillment experience for our sellers. You will be uplifting legacy applications into a microservice based architecture using the latest and greatest technologies. You will work closely with other development teams to bring a cohesive and intuitive selling experience to our customers across TCGplayer’s suite of tools. If you’re an experienced and disciplined engineer, with a desire to make a difference in the way we build new tools, this might be the perfect opportunity!What You Will AccomplishEnhance our order management capabilities as we expand internationally and into an omni-channel selling experience.You will collaborate with product managers, designers, and other engineers to define and deliver new features and enhancements.You will write clean, maintainable, and efficient code while adhering to, and helping to establish, best practices and coding standards.You will troubleshoot and resolve complex technical issues across the platform.You will stay updated on emerging technologies and industry trends to drive innovation within the team and further develop your own skills.What You Will BringBachelor’s degree in computer science, information technology or a related field, or a combination of education and experience8 or more years of experience as a software engineer building scalable web applications5+ years of C# experience (ASP.Net/.Net Core)Expert knowledge of RDBMS technologies (SQL Server, PostgreSQL) and familiarity with NoSQL stores (Redis, MongoDB, Elasticsearch)Experience with event driven architecture and technologies like: Kafka, AWS SNS/SQS, RabbitMQ, or AzureBusExperience with cloud platforms (AWS, GCP, Azure) and modern CI/CD frameworksThe base pay range for this position is expected in the range below:$115,200 - $199,700Base pay offered may vary depending on multiple individualized factors, including location, skills, and experience. The total compensation package for this position may also include other elements, including a target bonus and restricted stock units (as applicable) in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as PTO and parental leave). Details of participation in these benefit plans will be provided if an employee receives an offer of employment.If hired, employees will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.Please see the Talent Privacy Notice for information regarding how eBay handles your personal data collected when you use the TCGplayer Careers website or apply for a job with TCGplayer.TCGplayer, a subsidiary company of eBay, is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at careers@tcgplayer.com. We will make every effort to respond to your request for disability assistance as soon as possible. View our accessibility info to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities. It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.The eBay Jobs website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.","applicants_count":"101","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Technology, Information and Internet and Software Development"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Technology, Information and Internet and Software Development"},{"job_id":"4223280188","title":"API Developer","company":"Pen Manufacturing (Formerly Pendarvis Manufacturing)","location":"Anaheim, CA","posted_date_attr":"2025-05-07","posted_text":"2 weeks ago","link":"https://www.linkedin.com/jobs/view/api-developer-at-pen-manufacturing-formerly-pendarvis-manufacturing-4223280188?position=8&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=5yE5AnrzjVbzqqmmFuNBcw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4223280188?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"About Pen ManufacturingPen Manufacturing is a prominent player in the sheet metal fabrication industry, renowned for delivering precision-engineered solutions. We are a fast growing and fast paced manufacturing company. Committed to quality and innovation, we are seeking an experienced General Manager to lead our sheet metal manufacturing processes.About The RoleWe are looking for an experienced API Developer to join our cross-functional team. You’ll play a key role in building and maintaining the integrations that power our internal operations and external services. You will collaborate closely with project managers and other engineers to create efficient, secure, and scalable API connections between platforms like Tableau, Asana, Slack, and Zapier. This position is ideal for someone who thrives in a fast-paced, tool-integrated environment and enjoys optimizing data and workflow automation.What You'll DoDesign, develop, and maintain robust APIs and system integrations across internal and third-party platforms.Work with business stakeholders to understand integration needs and translate them into scalable API solutions.Build and maintain automated workflows using tools like Zapier and Asana to support business processes.Ensure data flows between systems like Tableau, Slack, and CRM platforms are accurate, secure, and timely.Monitor and troubleshoot existing API integrations and provide technical support to internal teams.Document integration architecture, API usage guidelines, and workflow processes.Collaborate with data teams to ensure seamless data access and visualization in Tableau.Advocate for and implement best practices in API security, scalability, and maintenance.Other responsibilities as assigned.Qualifications3+ years of experience in API development and systems integration.Strong proficiency in RESTful API design, JSON, and webhooks.Familiarity with cloud-based tools including Tableau, Asana, Slack, and Zapier.Experience with scripting or programming languages such as Python, Node.js, or JavaScript.Understanding of OAuth, API security best practices, and data privacy principles.Experience integrating with SaaS platforms and using no-code/low-code automation tools.Excellent problem-solving skills and attention to detail.Strong communication and documentation abilities.The Pay Range For This Role Is20 - 30 USD per hour(Remote (Anaheim, California, US))","applicants_count":"未找到","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Industrial Machinery Manufacturing"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Industrial Machinery Manufacturing"},{"job_id":"4231896623","title":"Software Engineer","company":"NBCUniversal","location":"Orlando, FL","posted_date_attr":null,"posted_text":"未知日期","link":"https://www.linkedin.com/jobs/view/software-engineer-at-nbcuniversal-4231896623?position=9&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=mB4TYDL%2FnZ2V66w8tZxJ3g%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4231896623?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"Company DescriptionNBCUniversal is one of the world's leading media and entertainment companies. We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations & Experiences. NBCUniversal is a subsidiary of Comcast Corporation.Our impact is rooted in improving the communities where our employees, customers, and audiences live and work. We have a rich tradition of giving back and ensuring our employees have the opportunity to serve their communities. We champion an inclusive culture and strive to attract and develop a talented workforce to create and deliver a wide range of content reflecting our world.Comcast NBCUniversal has announced its intent to create a new publicly traded company ('Versant') comprised of most of NBCUniversal's cable television networks, including USA Network, CNBC, MSNBC, Oxygen, E!, SYFY and Golf Channel along with complementary digital assets Fandango, Rotten Tomatoes, GolfNow, GolfPass, and SportsEngine. The well-capitalized company will have significant scale as a pure-play set of assets anchored by leading news, sports and entertainment content. The spin-off is expected to be completed during 2025.Job DescriptionAs a Software Engineer you will:Write modular and maintainable code, complete with unit tests, using Ruby on Rails, Typescript and Angular. Iteratively improve our features, systems and code in the Central domain of the SportsEngine platform. Develop in a Continuous Delivery environment where you will ship code to production daily. Collaborate with cross-functional team members such as Software Engineers, QA Engineers, UX Designers and Product Managers.Work with other software engineers, both front-end and back-end, through code reviews and pair programming. QualificationsAll candidates are required to meet the following qualifications:Have 1+ years of experience in the field of Software Engineering. Have a foundation in modern coding practices from which you are ready to contribute from and ready to grow upon. Ability to write quality, modular, maintainable, secure and testable code. Familiarity with testing best practices including unit and integration tests. Have a team-oriented attitude and seemingly endless intellectual curiosity. Familiarity with Ruby on Rails or Angular.Desired Candidates May Demonstrate The FollowingEffective in a highly collaborative cross functional team environment using Git and GitHub Pull Request workflows. Experience in a continuous delivery environment. Exhibit a deep respect for building software sustainably using modern techniques and industry best practices. A Bachelor's degree in Computer Science (or equivalent) is awesome, but not required. Bonus points if you have familiarity with our Technology Stack: Ruby on Rails, Amazon Web Services, Github, MySQL, Javascript, Typescript, Angular, Node.js, Serverless.Fully Remote: This position has been designated as fully remote, meaning that the position is expected to contribute from a non-NBCUniversal worksite, most commonly an employee’s residence.Additional InformationAs part of our selection process, external candidates may be required to attend an in-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access nbcunicareers.com as a result of your disability. You can request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.Although you'll be hired as an NBCU employee, your employment and the responsibilities associated with this job likely will transition to Versant in the future. By joining at this pivotal time, you'll be a part of this exciting company as it takes shape.For LA County and City Residents Only: NBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Associate","Employment type":"Full-time","Job function":"Engineering","Industries":"Broadcast Media Production and Distribution, Entertainment Providers, and Media Production"},"seniority":"Associate","employment_type":"Full-time","job_function":"Engineering","industries":"Broadcast Media Production and Distribution, Entertainment Providers, and Media Production"},{"job_id":"4171361631","title":"Staff Software Engineer","company":"OVERJET","location":"San Francisco Bay Area","posted_date_attr":"2025-02-05","posted_text":"3 months ago","link":"https://www.linkedin.com/jobs/view/staff-software-engineer-at-overjet-4171361631?position=10&pageNum=45&refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D&trackingId=zrPpCLQe43SXqrq2Wj10iA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4171361631?refId=RHG0zgVJaAKBSuLk98G9Qw%3D%3D","ref_id":"RHG0zgVJaAKBSuLk98G9Qw==","job_description":"Lead the Future of Dentistry. Overjet is the world-leader in dental AI. Already, thousands of dental providers and insurers rely on our platform to deliver the best possible care. Now, we’re looking for talented people to fulfill our mission: improve oral health for all.Overjet is where builders become leaders. Everyone here loves to make new things: new products, new partnerships, new content, and a new category of AI technology. And as Overjet grows ridiculously fast, so will you.Simply put, there’s no better place to accelerate your career. Come join us!The Role Overjet is hiring talented and motivated Staff Software Engineers to join our geographically disbursed Engineering team. We have open roles on both new and existing product development efforts.You will be one of Overjet’s most experienced technical experts in building valuable software products for our insurance and dental practice customers. You will participate in cross-functional project teams, execute on the technical direction of the projects you are working on, and mentor more junior engineers on the best technical approaches to solve problems.ResponsibilitiesDesign, develop, and maintain impactful software solutions that transform our customers ability to deliver the best outcomes for patientsWrite efficient and scalable code, ensuring code quality and adherence to best practicesAct as a key technical partner to cross-functional teams including ProductTroubleshoot and resolve software defects and performance issuesParticipate in code reviews and contribute to the continuous improvement of development processesRegularly scheduled and sometimes ad-hoc on-call rotations is part of the core job every engineer on our teamQualificationsExcellent academic background in Computer Science or other related fieldSignificant relevant experience writing code and delivering products with increasing levels of responsibilityStrong technical skills in programming languages such as Java, Python, Node, GoLang, C#, and SwiftStrong familiarity with cloud platforms such as Google Cloud Platform, Amazon Web Services, and Microsoft AzureYou love mentoring engineers and have a track record of doing so; you thrive when developing great people around you, in addition to great productsYou have experience in cultivating a strong engineering culture in an iterative, agile environmentExcellent verbal and written communication in English is requiredAbility to thrive in a fast-paced, technical, and mission-focused environmentExperience hiring and interviewing Why Overjet? Competitive Compensation and EquityHybrid workplace that provides flexibility, vibrant in-person workspaces, and the ability to build strong connections across all of Overjet - regardless of location401k plans with a matching programMedical, Dental and Vision coverage: 99% employee premium covered, 75% dependent premium coveredLife and AD+D Insurance 8 weeks Paid Parental Leave Optional HSA with Employer contributionFlexible Time Off and company paid holidaysAnnual Learning and Development StipendWork from Home StipendOur Hybrid WorkplaceWe have a unique hybrid workplace at Overjet — which combines the teamwork of meeting in person, with the flexibility of working from anywhere.Many of our positions are based in San Mateo, New York City, Boston, and Lahore. The Jetsetters who live in these “geo-hubs” come to the office on Tuesdays and Wednesdays, while having the option to work from home the rest of the week.Our People Team is happy to answer any questions about what hybrid work means for your specific role!Overjet's ValuesExcellence: We set ambitious goals and strive for excellence.Velocity: We focus, act with urgency, and deliver results.Ownership: We take ownership, dive deep and solve problems.Win-win: We play to win, setting ourselves and our customers up for success.Growth: We stay curious, seek feedback, and continuously learn and grow.Company RecognitionNamed one of the TIME Best Inventions of 2024Recognized in Newsweek’s Most Loved Workplaces in America 2024Won the Dental Health category at the Digital Health Awards 2024Honored as one of the 2024 Best Places to Work by Built InRecognized as one of the Top Startups of 2023 by LinkedInNamed one of the 2023 World’s Most Innovative Companies by Fast CompanyIncluded on the definitive 2022 Forbes AI 50Featured in Bloomberg, Forbes, Fast Company, and TechCrunchEEOCOverjet is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We believe diversity enriches our team so we hire people with a wide range of identities, backgrounds, and experiences. Even if you don't meet 100% of the qualifications for this job, we strongly encourage you to apply! If you are a Colorado resident: Please contact us by emailing recruiting@overjet.ai to receive compensation and benefits information for this role. Please include the job title in the subject line of the email.","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Software Development"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development"},{"job_id":"4173932838","title":"Full Stack Engineer","company":"SentiLink","location":"United States","posted_date_attr":"2025-05-13","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/full-stack-engineer-at-sentilink-4173932838?position=1&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=U%2B3LJk5D6CwiAEdctVHEOw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4173932838?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"About UsSentiLink provides innovative identity and risk solutions, empowering institutions and individuals to transact confidently with one another.By building the future of identity verification in the United States and reinventing the currently clunky, ineffective, and expensive process, we believe strongly that the future will be 10x better.We’ve had tremendous traction and are growing extremely quickly. Already our real-time APIs have helped verify hundreds of millions of identities, beginning with financial services. In 2021, we raised a $70M Series B round, led by Craft Ventures to rapidly scale our best in class products. We’ve earned coverage and awards from TechCrunch, CNBC, Bloomberg, Forbes, Business Insider, PYMNTS, American Banker, LendIt, and have been named to the Forbes Fintech 50 list consecutively since 2023. Last but not least, we’ve even been a part of history -- we were the first company to go live with the eCBSV and testified before the United States House of Representatives.About The OpportunityAs a Full Stack Engineer you will be responsible for the development and maintenance of our web application and platform that is used for Fraud analysis. You will be working closely with Product & Design, Solutions Engineering, Data Science, Infrastructure and the Data Platform teams to build new products and enhance our existing suite of products.Technologies: React, Golang, Python, PostgreSQL (RDS), Docker, AWS technologies (Lambda, Cognito and other standard technologies)This is a remote, US-based role.ResponsibilitiesCode, test, debug, document, and ship and maintain software applications using established coding standards and methodologiesDesigning and building out API’s that will be consumed by the UI to surface application data.Partner with product management to drive agile delivery of both existing and new products based on project requirements, UX design, and industry best practicesEnsure new software meets quality standards by writing unit and end-to-end automated testsWork with product, data, and other stakeholders to analyze usage and product metrics to inform key strategic decisionsTroubleshoot, debug, resolve product issues as they ariseWork cross functionally to resolve complex partner problemsEnsure platform and services meet SLA requirements; on call rotation for production issues, along with the rest of engineeringRequirements3+ years of software development experience building enterprise or consumer facing productsExperience with modern front-end JavaScript frameworks such as React or AngularExperience with building API based products using python, golang or similar technologiesExperience with RDBMS (e.g. postgres) and ability to write efficient queries with optimal structures is a big plusExperience with Docker and AWS technologies is a plusExcellent analytical and problem solving skills, interpersonal skills and a sense of humor (enjoy the journey)Experience working in a scrum / Agile development environmentFamiliarity working in Financial Services is a big plusCandidates must be legally authorized to work in the United States and must live in the United StatesSalary Range$145,000/year - $205,000/year + equity + benefitsNote: This salary range may be inclusive of several career levels, and the actual base salary within that range will be determined by several components including but not limited to the individual's experience, skills, and qualifications.PerksEmployer paid group health insurance for you and your dependents401(k) plan with employer match (or equivalent for non US-based roles)Flexible paid time offRegular company-wide in-person eventsHome office stipend, and more!Corporate ValuesFollow ThroughDeep UnderstandingWhatever It TakesDo Something Smart","applicants_count":"未找到","salary_range":"$130,000.00/yr","is_remote":true,"job_criteria":{"Seniority level":"Associate","Employment type":"Full-time","Job function":"Engineering","Industries":"Software Development"},"seniority":"Associate","employment_type":"Full-time","job_function":"Engineering","industries":"Software Development"},{"job_id":"4138457972","title":"Senior Software Engineer, Guest & Host","company":"Airbnb","location":"United States","posted_date_attr":"2025-05-16","posted_text":"4 days ago","link":"https://www.linkedin.com/jobs/view/senior-software-engineer-guest-host-at-airbnb-4138457972?position=2&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=Bv%2Bfmct8UnokL3eHnwaXFg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4138457972?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinWe are building Airbnb’s next-gen Media platform to help unlock a whole slew of immersive product features. As part of the Application Foundation Org, you collaborate with your team to build and improve the foundation that powers products across Airbnb.The Difference You Will MakeAs the Media Foundation Senior Backend Engineer, you work in a team of talented & diverse software engineers to build & operate Airbnb’s Media infrastructure. You play a significant role in shaping the technical vision and then delivering a solution that is flexible, efficient and scales with the needs of the business. Each individual brings their own unique skill set, experiences, thought leadership and technical expertise to solve these technical challenges for Airbnb.A Typical DayWork cross-functionally with product, design, and other engineering counterparts to execute on product and business strategy and build novel products and features that our users will love.Contribute to the full development cycle: technical design, development, test, experimentation, analysis, and launch. You’ll be reviewing code and design docs, giving feedback on product specs and mocks.Continuously learn and improve your technical and non-technical abilities.Your Expertise5+ years of relevant software development experience in a fast paced tech environment.You possess strong software skills in Java.You have excellent communication skills and the ability to work well within a team and with teams across the engineering, product & design organizations You are passionate about efficiency, availability, technical quality and system quality.Experience working with image processing or content video transcoding.Your Location:This position is US - Remote Eligible. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. While the position is Remote Eligible, you must live in a state where Airbnb, Inc. has a registered entity. Click here for the up-to-date list of excluded states. This list is continuously evolving, so please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.We strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process.We ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.How We'll Take Care Of YouOur job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits.Pay Range$191,000—$223,000 USD","applicants_count":"未找到","salary_range":"$191,000.00/yr","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Research and Engineering","Industries":"Software Development"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Research and Engineering","industries":"Software Development"},{"job_id":"4227410113","title":"Senior Full Stack Software Engineer (Remote)","company":"Mogo","location":"United States","posted_date_attr":"2025-05-09","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/senior-full-stack-software-engineer-remote-at-mogo-4227410113?position=3&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=Xuiac5Y08Y7IBci6yLyzYA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4227410113?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"At Mogo, we’re on a mission to disrupt the wealth industry with Intelligent Investing, a platform built to maximize investor returns—not firm profits. The rise of AI is transforming the world, and we see a massive opportunity to be at the forefront of this shift, using AI to help us build the first investing platform truly optimized for performance.We think in first principles, move fast, and operate like an elite Wall Street firm meets tech disruptor. If you have the engineering chops to build game-changing solutions, we want you.We’re looking for a Senior Full Stack Software Engineer (backend-focused) to join our tight-knit team. If you're proactive, collaborative, and love building legendary products, check out the details below—this might be the perfect role for you.The base salary for this role is $115,000 - $150,000Accepting applications from Canadian applicants only.What You’ll DoWrite, review, and maintain solid TypeScript + Node.js, working with MongoDB and MySQL databases.Develop, release, and maintain microservices for web and mobile applications.Collaborate with engineers and researchers to explore and integrate AI-driven solutions that enhance web and mobile application capabilities.Define and own key test metrics while advocating for best testing practices.Apply best practices and stay informed about emerging industry trends.Evaluate and recommend solutions, contributing to team decision-making processes.Demonstrate a strong understanding of modern web development tools, public cloud infrastructure (e.g., AWS, Google Cloud, OCI), and CI/CD pipelines (e.g., Jenkins, GitLab CI/CD, CodePipeline, CircleCI).Collaborate within a cross-functional squad that includes disciplines like Design and Product Management.Participate in code reviews to improve coding standards and practices while delivering production-quality code.Display organizational skills to design, plan, prioritize, and drive technical projects to successful launch.Mentor team members, engage in pair programming, share insights, and support the growth of those around you.What You’ll NeedBachelor’s degree in Computer Science or a related field, or equivalent work experience (self taught totally welcome!)Experience with Node.js, TypeScript, MongoDB, and AWS services (e.g., Lambda, SQS, S3).Experience with Micro Services Arch.,Event Driven Architecture (RabbitMQ, Kafka etc.), serverless Architecture.Experience with React/React Native.Prior experience with Ruby is a big plus.Strong experience in TDD and writing comprehensive unit, integration, and end-to-end tests.Experience with Amazon Cdk is a plus.Proven track record of developing scalable products.Experience in building batch processing jobs and distributed systems for large-scale data processing.Strong problem-solving skills.A collaborative team player who is open to feedback, eager to learn, and confident in contributing ideas and expertise.A willingness to challenge the status quo constructively, with a determination to build exceptional software.Benefits Of Working With UsALWAYS FULLY REMOTE WORK - Enjoy the flexibility of remote work, supported by necessary resources Comprehensive Health and Wellness - Access medical, dental, and vision coverage plus a Health Spending AccountStock Options - Have a stake in the company's success through stock optionsFlex Vacation - Benefit from paid time off, including vacation days, holidays, and personal daysWellbeing Programs - Access counselling services, mental health support, and additional wellness resourcesAbout UsWe help make it easy for Canadians to achieve financial freedom while making a positive impact.We live in the most innovative and technologically advanced era, yet so much struggle exists. Most of us are far from where we want to be financially.We all want a better future. A better world where reaching financial freedom is a question of when, not if. One that's equitable so that all can prosper. One that's safe from the impact of climate change.Our money has the power to change the world. It’s up to us to do things differently.Apply today! Do you know anyone who would be a great fit for this role or other roles on our career page? Please share this job posting with them! Mogo is an inclusive place to spend your work life. We hire team members for their talent and diverse backgrounds. Bring your unique perspective to Mogo and help our customers achieve their best financial lives.","applicants_count":"未找到","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Financial Services"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services"},{"job_id":"4058658747","title":"Software Engineer - Extensibility","company":"Figma","location":"San Francisco, CA","posted_date_attr":"2025-05-12","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-extensibility-at-figma-4058658747?position=4&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=jT7xtMZFwaZDXRZ6sCMwBA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4058658747?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"Figma is growing our team of passionate people on a mission to make design accessible to all. Born on the Web, Figma helps entire product teams brainstorm, design and build better products — from start to finish. Whether it’s consolidating tools, simplifying workflows, or collaborating across teams and time zones, Figma makes the design process faster, more efficient, and fun while keeping everyone on the same page. From great products to long-lasting companies, we believe that nothing great is made alone—come make with us!The Extensibility team owns Figma’s developer platform: plugins, widgets, REST API, and webhooks. Entire companies have been built around Figma plugins. Tens of thousands of designers at large Figma customers use private plugins to work faster. Developers use our APIs to power workflows that synchronize design system variables from GitHub into Figma variables, and update project management tasks when designs are marked ready for development.Our team touches broad parts of the Figma product: maintaining a JavaScript sandbox, creating new kinds of plugins for Dev Mode, optimizing JSON encoding in C++, operating large-scale live services written in Node and Go, updating our multiplayer service to accept server-side writes, and writing a React-style “diffing” algorithm for widgets. We also do a moderate amount of fullstack development with a React frontend and a Sinatra backend.This is a full time role that can be held from one of our US hubs or remotely in the United States.What you'll do at Figma:Write Typescript, Ruby, and C++ code implementing new features, fixing bugs, and performance issues.Work with Figma product teams to help their features get exposed programmatically via our plugin and REST API.Work closely with product managers and product designers to design simple experiences for complex UX problems.Meet with members of our developer community to understand their successes and pain points.We’d love to hear from you if you have:Industry experience working on a developer platform or developer tooling.5+ years of experience with React or similar front-end Typescript frameworks.Experience with distributed systems and/or running a high volume public API.Experience with ORMs, reading and writing SQL, and debugging query plans.While it’s not required, it’s an added plus if you also have:Experience embedding a virtual machine in another programming language.Experience with WebAssembly.C++ or C experience.Extensive experience building developer platforms or open source communities.A strong design sense and proven track record working closely with product designers.Pay Transparency DisclosureIf based in Figma’s San Francisco or New York hub offices, this role has the annual base salary range stated below.Job level and actual compensation will be decided based on factors including, but not limited to, individual qualifications objectively assessed during the interview process (including skills and prior relevant experience, potential impact, and scope of role), market demands, and specific work location. The listed range is a guideline, and the range for this role may be modified. For roles that are available to be filled remotely, the pay range is localized according to employee work location by a factor of between 80% and 100% of range. Please discuss your specific work location with your recruiter for more information.Figma offers equity to employees, as well a competitive package of additional benefits, including health, dental & vision, retirement with company contribution, parental leave & reproductive or family planning support, mental health & wellness benefits, generous PTO, company recharge days, a learning & development stipend, a work from home stipend, and cell phone reimbursement. Figma also offers sales incentive pay for most sales roles and an annual bonus plan for eligible non-sales roles. Figma’s compensation and benefits are subject to change and may be modified in the future.Annual Base Salary Range (SF/NY Hub):$149,000—$350,000 USDAt Figma we celebrate and support our differences. We know employing a team rich in diverse thoughts, experiences, and opinions allows our employees, our product and our community to flourish. Figma is an equal opportunity workplace - we are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity/expression, veteran status, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.We will work to ensure individuals with disabilities are provided reasonable accommodation to apply for a role, participate in the interview process, perform essential job functions, and receive other benefits and privileges of employment. If you require accommodation, please reach out to accommodations-ext@figma.com. These modifications enable an individual with a disability to have an equal opportunity not only to get a job, but successfully perform their job tasks to the same extent as people without disabilities.Examples of accommodations include but are not limited to:Holding interviews in an accessible locationEnabling closed captioning on video conferencingEnsuring all written communication be compatible with screen readersChanging the mode or format of interviews To ensure the integrity of our hiring process and facilitate a more personal connection, we require all candidates keep their cameras on during video interviews. Additionally, if hired you will be required to attend in person onboarding.By applying for this job, the candidate acknowledges and agrees that any personal data contained in their application or supporting materials will be processed in accordance with Figma's Candidate Privacy Notice.","applicants_count":"180","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Design Services"},"seniority":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Design Services"},{"job_id":"4231439929","title":"Full Stack Engineer","company":"Dexian","location":"Eden Prairie, MN","posted_date_attr":null,"posted_text":"未知日期","link":"https://www.linkedin.com/jobs/view/full-stack-engineer-at-dexian-4231439929?position=5&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=XfOVAAViVEXhze%2FM2Qghdg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4231439929?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"Job Title: Senior .NET Developer (C# / SQL / REST API)Location: [Remote]Job Type: [ Contract to hire]Job DescriptionWe are seeking a Senior .NET Developer with strong expertise in C#, SQL/Oracle, and REST APIs to join our dynamic development team. The ideal candidate will have a passion for clean code, strong problem-solving skills, and a team-oriented mindset. Experience with .NET, Angular, and working in a healthcare environment is highly desirable.Required QualificationsMinimum 8 years of hands-on experience with:C# (highest priority)SQL/Oracle (we work with both but predominantly Oracle)REST API developmentStrong experience with:.NET frameworkAngularProven ability to work in a collaborative team environmentStrong debugging, problem-solving, and code optimization skillsPreferred QualificationsExperience in the Healthcare industryMust-Have Skills (Stack-Ranked by Importance)C# / .NET – Expert-level experience requiredOracle – Strong hands-on experienceAngular – Mid to advanced experience preferredDisqualifiersLack of experience with C#Missing any of the core required skills: C#, SQL/Oracle, .NET, REST API, AngularPerformance IndicatorsCode QualityProblem Solving AbilityTeam CollaborationTimely Delivery of Features and FixesDexian is a leading provider of staffing, IT, and workforce solutions with over 12,000 employees and 70 locations worldwide. As one of the largest IT staffing companies and the 2nd largest minority-owned staffing company in the U.S., Dexian was formed in 2023 through the merger of DISYS and Signature Consultants. Combining the best elements of its core companies, Dexian's platform connects talent, technology, and organizations to produce game-changing results that help everyone achieve their ambitions and goals.Dexian's brands include Dexian DISYS, Dexian Signature Consultants, Dexian Government Solutions, Dexian Talent Development and Dexian IT Solutions. Visit https://dexian.com/ to learn more.Dexian is an Equal Opportunity Employer that recruits and hires qualified candidates without regard to race, religion, sex, sexual orientation, gender identity, age, national origin, ancestry, citizenship, disability, or veteran status","applicants_count":"未找到","salary_range":"未找到","is_remote":false,"job_criteria":{"Seniority level":"Mid-Senior level","Employment type":"Contract","Job function":"Analyst","Industries":"IT Services and IT Consulting"},"seniority":"Mid-Senior level","employment_type":"Contract","job_function":"Analyst","industries":"IT Services and IT Consulting"},{"job_id":"4159722872","title":"Full Stack Developer","company":"DataAnnotation","location":"United States","posted_date_attr":"2025-04-11","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/full-stack-developer-at-dataannotation-4159722872?position=6&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=r%2Bm3%2BK4alSizrZXtFJd2Lw%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4159722872?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.We are looking for a proficient Full Stack Developer to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.To apply to this role, you will need to be proficient in either Python and/or JavaScript. Your role will require proficiency in at least one programming language/framework (JavaScript, TypeScript, Python, C, C#, C++, HTML/CSS, React, Go, Java, Kotlin, SQL, or Swift) in order to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.Benefits:This is a full-time or part-time REMOTE positionYou’ll be able to choose which projects you want to work onYou can work on your own scheduleProjects are paid hourly, starting at $40+ USD per hour, with bonuses for high-quality and high-volume workResponsibilities:Come up with diverse problems and solutions for a coding chatbotWrite high-quality answers and code snippetsEvaluate code quality produced by AI models for correctness and performanceQualifications:Fluency in English (native or bilingual level)Proficient in either Python and/or JavaScriptExcellent writing and grammar skillsA bachelor's degree (completed or in progress)Previous experience as a Software Developer, Coder, Software Engineer, or ProgrammerNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, UK, Canada, Australia, or New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.","applicants_count":"127","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Not Applicable","Employment type":"Contract","Job function":"Engineering, Research, and Analyst","Industries":"Software Development, Computer and Network Security, and Engineering Services"},"seniority":"Not Applicable","employment_type":"Contract","job_function":"Engineering, Research, and Analyst","industries":"Software Development, Computer and Network Security, and Engineering Services"},{"job_id":"4124964532","title":"Full-Stack Engineer - Acryl Data","company":"8VC","location":"United States","posted_date_attr":"2025-01-15","posted_text":"4 months ago","link":"https://www.linkedin.com/jobs/view/full-stack-engineer-acryl-data-at-8vc-4124964532?position=7&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=aEitezDt%2FiWvIW%2FK5uklhg%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4124964532?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"AboutAcryl Data is the company behind DataHub, the leading open-source metadata platform. Originally developed at LinkedIn, DataHub has grown into the largest open-source metadata community with over 12,000 data practitioners and deployments across 3,000+ organizations worldwide.Through our flagship product DataHub Cloud, we provide enterprise-grade data catalog and observability solutions that enable seamless data discovery, robust data observability, and federated governance across organizations' entire data ecosystem. Our customers range from innovative startups to Fortune 10 companies, all benefiting from our expertise in bringing clarity and control to complex data environments.Founded by the original creators of LinkedIn DataHub and Airbnb Dataportal, and backed by top-tier venture capital firms, Acryl Data combines deep technical expertise with a proven track record in building industry-leading data platforms.Role OverviewWe're seeking a seasoned Full Stack Engineering Lead to architect and drive the development of our high-performance, consumer-grade data platform. In this role, you'll lead the technical direction of our user-facing products, focusing on building scalable, responsive applications that handle complex data visualizations and interactions for data discovery, data quality, and data governance. You'll work at the intersection of technical excellence and user experience, ensuring our platform maintains sub-second response times while processing large datasets.Key ResponsibilitiesArchitect and lead the development of high-performance web applications with a focus on scalability and user experienceMentor and guide a team of engineers, fostering best practices in code quality, testing, and performance optimizationDrive technical decisions and architecture choices that enable rapid product iteration while maintaining system reliabilityCollaborate with product, design, and backend teams to deliver seamless user experiencesEstablish performance metrics and optimization strategies for complex data visualizations and interactionsLead code reviews and technical discussions to ensure high-quality implementationRequired Qualifications8+ years of full-stack engineering experience, with at least 3 years in a technical leadership roleProven track record of building and scaling consumer-facing web applications that handle significant user trafficDeep expertise in React, TypeScript, a JS testing framework (cypress, enzyme, react-testing), and modern frontend architecture patternsStrong experience with performance optimization, including code splitting, lazy loading, and state managementExpertise in GraphQL and frameworks like Apollo, with experience optimizing query performance and caching strategiesExperience with real-time data visualization and complex UI interactionsStrong background in building and maintaining microservices architectureTrack record of leading architectural decisions and technical initiativesExperience mentoring engineers and driving technical excellence within teamsFamiliarity with tools in the modern data and ML ecosystemPreferred QualificationsExperience working with DataHub is a huge plus!Previous experience at an early stage startupKnowledge of data governance and security best practicesTrack record of implementing data quality frameworksContributing to open-source projectsIf you're passionate about technology, enjoy working with customers, and want to be part of a fast-growing company changing the industry, we want to hear from you!How We WorkRemote first. We're a fully-distributed company, and our interaction culture is deliberately mixed between meeting culture and written. We're writing heavily because it forces clarity of thought; we have plenty of synchronous time to give space for collaborative ideation.At Acryl Data, representation matters – for us to build the best, most inclusive, accessible product for our community members, our work and team must reflect the lived experiences, unique perspectives, and communities around us. We are proud to be an equal opportunity workplace.BenefitsCompetitive salaryEquity99% coverage of medical, dental and vision insurance for US EmployeesCarrot Fertility and Family Planning Remote friendlyMonthly co-working salaryOne-time home office budget","applicants_count":"116","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Venture Capital and Private Equity Principals"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Venture Capital and Private Equity Principals"},{"job_id":"4231487674","title":"Front-End Developer - React.js","company":"Kforce Inc","location":"Plano, TX","posted_date_attr":null,"posted_text":"未知日期","link":"https://www.linkedin.com/jobs/view/front-end-developer-react-js-at-kforce-inc-4231487674?position=8&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=G02JGwnKX1dRBIv7is4wGA%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4231487674?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"ResponsibilitiesKforce has a client in Plano, TX that is seeking a Front-End Developer - React.js. Summary: As a React Developer on our team, you will work closely with product managers, designers, and senior developers to create intuitive, scalable, and high-performance user interfaces for AI-powered applications. You'll have the opportunity to work on exciting projects where AI and machine learning intersect with modern web technologies, contributing to the design and development of innovative solutions. Responsibilities: Develop, test, and maintain responsive, user-friendly React applications for AI-driven products Collaborate with cross-functional teams, including AI/ML engineers, to integrate machine learning models and data-driven insights into the user interface Optimize application performance, focusing on both user experience and AI performance Participate in code reviews and contribute to team knowledge sharing Write clean, maintainable, and well-documented code Assist in troubleshooting and debugging production issues Stay up to date with the latest trends in React development and AI technologies, ensuring best practices are followedRequirements 1-3 years of experience in React.js development, with a strong understanding of modern JavaScript (ES6+), HTML, CSS, and related web technologies Experience building and deploying AI-powered applications or working with AI APIs (such as TensorFlow.js, OpenAI, etc.) Familiarity with integrating machine learning models and data visualizations into React applications Experience with state management libraries like Redux or React Context API Strong understanding of RESTful APIs and asynchronous JavaScript (Promises, async/await) Knowledge of version control systems (Git) Ability to write clean, efficient, and maintainable code Good problem-solving skills and attention to detailThe pay range is the lowest to highest compensation we reasonably in good faith believe we would pay at posting for this role. We may ultimately pay more or less than this range. Employee pay is based on factors like relevant education, qualifications, certifications, experience, skills, seniority, location, performance, union contract and business needs. This range may be modified in the future.We offer comprehensive benefits including medical/dental/vision insurance, HSA, FSA, 401(k), and life, disability & ADD insurance to eligible employees. Salaried personnel receive paid time off. Hourly employees are not eligible for paid time off unless required by law. Hourly employees on a Service Contract Act project are eligible for paid sick leave.Note: Pay is not considered compensation until it is earned, vested and determinable. The amount and availability of any compensation remains in Kforce's sole discretion unless and until paid and may be modified in its discretion consistent with the law.This job is not eligible for bonuses, incentives or commissions.Kforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.By clicking “Apply Today” you agree to receive calls, AI-generated calls, text messages or emails from Kforce and its affiliates, and service providers. Note that if you choose to communicate with Kforce via text messaging the frequency may vary, and message and data rates may apply. Carriers are not liable for delayed or undelivered messages. You will always have the right to cease communicating via text by using key words such as STOP.","applicants_count":"未找到","salary_range":"$45.00/hr","is_remote":false,"job_criteria":{"Seniority level":"Associate","Employment type":"Contract","Job function":"Engineering and Information Technology","Industries":"Computer Networking Products, Software Development, and Writing and Editing"},"seniority":"Associate","employment_type":"Contract","job_function":"Engineering and Information Technology","industries":"Computer Networking Products, Software Development, and Writing and Editing"},{"job_id":"4146252696","title":"Full Stack Developer","company":"DataAnnotation","location":"Philadelphia, PA","posted_date_attr":"2025-04-11","posted_text":"1 month ago","link":"https://www.linkedin.com/jobs/view/full-stack-developer-at-dataannotation-4146252696?position=9&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=i5E5vHSh%2FsmxPrOULo51ag%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4146252696?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.We are looking for a proficient Full Stack Developer to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.To apply to this role, you will need to be proficient in either Python and/or JavaScript. Your role will require proficiency in at least one programming language/framework (JavaScript, TypeScript, Python, C, C#, C++, HTML/CSS, React, Go, Java, Kotlin, SQL, or Swift) in order to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.Benefits:This is a full-time or part-time REMOTE positionYou’ll be able to choose which projects you want to work onYou can work on your own scheduleProjects are paid hourly, starting at $40+ USD per hour, with bonuses for high-quality and high-volume workResponsibilities:Come up with diverse problems and solutions for a coding chatbotWrite high-quality answers and code snippetsEvaluate code quality produced by AI models for correctness and performanceQualifications:Fluency in English (native or bilingual level)Proficient in either Python and/or JavaScriptExcellent writing and grammar skillsA bachelor's degree (completed or in progress)Previous experience as a Software Developer, Coder, Software Engineer, or ProgrammerNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, UK, Canada, Australia, or New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.","applicants_count":"41","salary_range":"未找到","is_remote":true,"job_criteria":{"Seniority level":"Not Applicable","Employment type":"Contract","Job function":"Engineering, Analyst, and Research","Industries":"Software Development, Engineering Services, and Computer and Network Security"},"seniority":"Not Applicable","employment_type":"Contract","job_function":"Engineering, Analyst, and Research","industries":"Software Development, Engineering Services, and Computer and Network Security"},{"job_id":"4158688840","title":"Software Engineer","company":"CDK Global","location":"United States","posted_date_attr":"2025-05-09","posted_text":"1 week ago","link":"https://www.linkedin.com/jobs/view/software-engineer-at-cdk-global-4158688840?position=10&pageNum=47&refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D&trackingId=FC8ECBK22zHE%2BJMstE5RtQ%3D%3D","detail_url":"https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4158688840?refId=%2FYOc6ba5WS61q%2FBwcq4VgA%3D%3D","ref_id":"/YOc6ba5WS61q/Bwcq4VgA==","job_description":"About UsCDK Global is a leading provider of cloud-based software to dealerships and Original Equipment Manufacturers (“OEMs”) across automotive and related industries. The Company’s cloud-based, software as a service (“SaaS”) platform enables dealerships to manage their end-to-end business operations including the acquisition, sale, financing, insuring, repair, and maintenance of vehicles. By automating and streamlining critical workflows, the integrated platform of modern solutions enables dealers to sell and service more vehicles by creating simple and convenient experiences for customers and improves their financial and operational performance.Primary ResponsibilitiesUse comprehensive knowledge of Business Intelligence and Datawarehouse applications and best practices to create and design sophisticated, imaginative and efficient reusable Reporting solutions across multiple browsers for various devices and operating systems.Design reusable components by utilizing various standard frameworks.Evaluate requirements and initial mock-ups; make technology recommendations that support optimal construction, maintenance and performance.Leverage the latest developments in Internet technologies.Serve as a technical resource and mentor.Experience(with Masters) 7+ years of programming experience in building enterprise web solutions(with Bachelors) 10+ years of programming experience in building enterprise web solutionsQualificationsStrong proficiency in React.js and experience with other JavaScript frameworks (Vue.js, Angular, etc.).Deep knowledge of Node.js and NestJS for building robust back-end services.Experience with microfrontends architecture and best practices.Solid understanding of RESTful APIs, GraphQL, and WebSocket.Experience with SQL/NoSQL databases (e.g.MongoDB, PostgreSQL, MySQL)Strong experience in using modern JavaScript,TypeScript, and ES6+ features.Knowledge of modern front-end tools and workflows (Webpack, Babel, etc.).Familiarity with CI/CD pipelines and version control systems like Git.Strong understanding of web performance optimization techniques.Experience in writing unit tests and using testing frameworks (Jest, Mocha, etc.).Hands on experience publishing of various kinds of interactive data visualizations and dashboardsAbility to work in a fast paced and agile development environment.Experience in building scalable, maintainable applications using modern web technologiesAbility to technically document software deliverables through use cases, design documents and technical specifications.Motivated to drive tasks to completion and take ownership of projects.Must have a strong ability to understand existing codebase by efficient debugging, code analysis, and by asking the right questionsDesired SkillsKnowledge of BI Tools like Looker, Tableau or Power BIExperience with Snowflake, Postgres, Dynamo or Mongo db is a plus.Familiarity with containerization technologies (Docker, Kubernetes).Experience with test-driven development in an agile software environment.Experience working with clients in a professional services organization.Experience building large-scale web applications using Single Page Applications.Experience translating design mockups and prototypes into working application designs.Have developed or supported an operationally critical web service.Demonstrated passion for user experience design and improving usability.Demonstrated passion about technology, have a strong interest in learning about and playing with the latest technologiesBase Compensation: $90,000 - $118,000CDK Global is committed to fair and equitable compensation practices. Compensation packages are based on several factors, including but not limited to skills, experience, certifications, and work location. The total compensation package for this position may also include annual performance bonus, benefits and/or other applicable incentive compensation plans.We offer Medical, dental, and vision benefits in addition to:Paid Time Off (PTO)401K Matching ProgramTuition ReimbursementAt CDK, we believe inclusion and diversity are essential in inspiring meaningful connections to our people, customers and communities. We are open, curious and encourage different views, so that everyone can be their best selves and make an impact.CDK is an Equal Opportunity Employer committed to creating an inclusive workforce where everyone is valued. Qualified applicants will receive consideration for employment without regard to race, color, creed, ancestry, national origin, gender, sexual orientation, gender identity, gender expression, marital status, creed or religion, age, disability (including pregnancy), results of genetic testing, service in the military, veteran status or any other category protected by law.Applicants for employment in the US must be authorized to work in the US. CDK may offer employer visa sponsorship to applicants.","applicants_count":"未找到","salary_range":"$90,000.00/yr","is_remote":false,"job_criteria":{"Seniority level":"Entry level","Employment type":"Full-time","Job function":"Engineering and Information Technology","Industries":"Software Development"},"seniority":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development"}]